{"text": "\n\nLes Misérables is a 2012 musical drama film directed by Tom Hooper and scripted by William Nicholson, Alain Boublil, Claude-Michel Schönberg, and Herbert Kretzmer, based on the 1862 French novel of the same name by Victor Hugo, which also inspired a 1980 musical by Boublil and Schönberg. The film is a British and American venture distributed by Universal Pictures. The film stars an ensemble cast led by Hugh Jackman, Russell Crowe, Anne Hathaway, Eddie Redmayne, Amanda Seyfried, Helena Bonham Carter, and Sacha Baron Cohen.\nThe film takes place in France during the early 19th century and tells the story of Jean Valjean who, while being hunted for decades by the ruthless policeman Javert after breaking parole, agrees to care for a factory worker's daughter. The story reaches resolution against the background of the June Rebellion.\nFollowing the release of the 1980 musical, a film adaptation was mired in \"development hell\" for over ten years, as the rights were passed on to several major studios, and various directors and actors considered. In 2011, producer Cameron Mackintosh sold the film rights to Eric Fellner, who financed the film through his Working Title Films. In June 2011, production of the film officially began, with Hooper and Mackintosh serving as director and producer, and the main characters were cast later that year. Principal photography commenced in March 2012, with a budget of $61 million. Filming took place on locations in Greenwich, London, Chatham, Winchester, Bath, and Portsmouth, England; in Gourdon, France; and on soundstages in Pinewood Studios.\nLes Misérables held its world premiere at Leicester Square in London on 5 December 2012, and was released 25 December 2012 in the United States and 11 January 2013 in the United Kingdom. It grossed over $441 million worldwide. The film received generally favourable reviews, with many critics praising the cast, with Jackman, Hathaway, Redmayne and Samantha Barks being the most often singled out for praise. The film won the Golden Globe Award for Best Motion Picture – Musical or Comedy, the Golden Globe Award for Best Actor – Motion Picture Musical or Comedy for Jackman, and the Golden Globe Award for Best Supporting Actress – Motion Picture for Hathaway. It also won four British Academy Film Awards (BAFTA), including for Best Actress in a Supporting Role for Hathaway. Additionally, it received eight Academy Award nominations, including Best Picture (the first musical nominated since 2002's winner Chicago) and Best Actor for Jackman, and won three, for Best Sound Mixing, Best Makeup and Hairstyling, and Best Supporting Actress for Hathaway.\n", "wiki_page_id": 33029735, "imdb_id": "tt1707386"}