{"text": "\n\nRa.One is a 2011 Indian superhero film directed by Anubhav Sinha and starring Armaan Verma, Shah Rukh Khan, Kareena Kapoor Khan, Arjun Rampal, Shahana Goswami and Tom Wu in pivotal roles. The script, written by Anubhav Sinha and Kanika Dhillon, originated as an idea that Anubhav Sinha got when he saw a television commercial, and which he subsequently expanded. The film follows Shekhar Subramanium (Shah Rukh Khan), a game designer who creates a motion sensor-based game in which the antagonist (Ra.One) is more powerful than the protagonist (G.One). The former escapes from the game's virtual world and enters the real world; his aim is to kill Lucifer, the game ID of Shekhar's son and the only player to have challenged Ra.One's power. Relentlessly pursued, the family is forced to bring out G.One from the virtual world to defeat Ra.One and protect them.\nPrincipal photography began in March 2010 and took place in India and the United Kingdom and was overseen by an international crew. The post-production involved 3-D conversion and the application of visual effects, the latter being recognised as a technological breakthrough among Indian films. With a budget of ₹150 crore (equivalent to ₹220 crore or US$31 million in 2017), inclusive of publicity costs, Ra.One was the most expensive Indian film at the time of release surpassing the ₹132 crore (equivalent to ₹211 crore or US$29 million in 2017) budget of Enthiran. The producers spent ₹130 crore (equivalent to ₹191 crore or US$27 million in 2017) out of a ₹52 crore (equivalent to ₹76 crore or US$11 million in 2017) marketing budget, which involved a nine-month publicity campaign, brand tie-ups, merchandise, video games and viral marketing.\nThe film faced controversies involving plagiarism, content leaks and copyright challenges. Consequently, Ra.One was theatrically released on 26 October 2011, the beginning of the five-day Diwali weekend, in 2D, 3D and dubbed versions, with three international premieres being held between 24 & 26 October 2011. The film witnessed the largest international theatrical release for an Indian film as of 2011, and was preceded by high audience and commercial expectations.\nUpon release, Ra.One received mixed reviews, with critics praising the visuals and music, but criticising the script and direction. Commercially, the film became the third highest-grossing Bollywood film of 2011 domestically, the second highest-grossing Bollywood film of 2011 worldwide, and broke a number of opening box office records, though it managed to sustain at the box office after its extended opening weekend. As the film earned more than Rs 170 crores it was considered a Box office Hit and a superhit film as the distributors recovered their investment. The film subsequently won a number of awards for its technical aspects, notably one National Film Award, one Filmfare Award and four International Indian Film Academy Awards.\n", "wiki_page_id": 26008898, "imdb_id": "tt1562871"}