{"text": "\n\nPan's Labyrinth (Spanish: El laberinto del fauno, lit. 'The Labyrinth of the Faun') is a 2006 Mexican/Spanish dark fantasy drama film written and directed by Guillermo del Toro. It was produced and distributed internationally by Esperanto Filmoj and Warner Bros., while Picturehouse handled US distribution rights.\nThe story takes place in Spain in the summer of 1944, five years after the Spanish Civil War, during the early Francoist period. The narrative intertwines this real world with a mythical world centered on an overgrown, abandoned labyrinth and a mysterious faun creature, with whom the main character, Ofelia, interacts. Ofelia's stepfather, the Falangist Captain Vidal, hunts the Spanish Maquis who fight against the Francoist regime in the region, while Ofelia's pregnant mother Carmen grows increasingly ill. Ofelia meets several strange and magical creatures who become central to her story, leading her through the trials of the old labyrinth garden. The film employs make-up, animatronics, and CGI effects to bring life to its creatures.\nDel Toro stated that he considers the story to be a parable, influenced by fairy tales, and that it addresses and continues themes related to his earlier film The Devil's Backbone (2001), to which Pan's Labyrinth is a spiritual successor, according to del Toro in his director's DVD commentary. The original Spanish title refers to the fauns of Roman mythology, while the English, German and French titles refer specifically to the faun-like Greek deity Pan. However, del Toro has stated that the faun in the film is not Pan.The film premiered at the 2006 Cannes Film Festival. It was released in the United Kingdom on 24 November 2006. In the United States and Canada, the film was given a limited release on 29 December 2006, with a wide release on 19 January 2007. Pan's Labyrinth opened to widespread critical acclaim. The film won numerous international awards, including three Academy Awards, three BAFTA Awards including Best Film Not in the English Language, the Ariel Award for Best Picture, the Saturn Awards for Best International Film and Best Performance by a Younger Actor for Ivana Baquero and the 2007 Hugo Award for Best Dramatic Presentation, Long Form.\n\n", "wiki_page_id": 3261733, "imdb_id": "tt0457430"}