{"text": "\n\nThe Longest Day is a 1962 epic war film based on Cornelius Ryan's 1959 book The Longest Day (1959), about the D-Day landings at Normandy on June 6, 1944, during World War II. The film was produced by Darryl F. Zanuck, who paid author Ryan $175,000 for the film rights. The screenplay was by Ryan, with additional material written by Romain Gary, James Jones, David Pursall and Jack Seddon. It was directed by Ken Annakin (British and French exteriors), Andrew Marton (American exteriors), and Bernhard Wicki (German scenes).\nThe Longest Day, which was made in black and white, features a large ensemble cast including John Wayne, Kenneth More, Richard Todd, Robert Mitchum, Richard Burton, Steve Forrest, Sean Connery, Henry Fonda, Red Buttons, Peter Lawford, Eddie Albert, Jeffrey Hunter, Stuart Whitman, Tom Tryon, Rod Steiger, Leo Genn, Gert Fröbe, Irina Demick, Bourvil, Curt Jürgens, George Segal, Robert Wagner, Paul Anka, and Arletty. Many of these actors played roles that were essentially cameo appearances. In addition, several cast members – including Fonda, Genn, More, Steiger and Todd – saw action as servicemen during the war; Todd was among the first British officers to land in Normandy in Operation Overlord, and he participated in the assault on Pegasus Bridge.\nThe film employed several Axis and Allied military consultants who had been actual participants on D-Day. Many had their roles re-enacted in the film. These included Günther Blumentritt (a former German general), James M. Gavin (an American general), Frederick Morgan (Deputy Chief of Staff at SHAEF), John Howard (who led the airborne assault on the Pegasus Bridge), Lord Lovat (who commanded the 1st Special Service Brigade), Philippe Kieffer (who led his men in the assault on Ouistreham), Marie-Pierre Kœnig (who commanded the Free French Forces in the invasion), Max Pemsel (a German general), Werner Pluskat (the major who was the first German officer to see the invasion fleet), Josef \"Pips\" Priller (the hot-headed pilot), and Lucie Rommel (widow of Field Marshal Erwin Rommel).\nA colorized version of this film was released on VHS in 1994, the 50th anniversary of the invasion.\nThe movie won two Academy Awards and was nominated for three others.\n", "wiki_page_id": 1343139, "imdb_id": "tt0056197"}