{"text": "\n\nWilliam Shakespeare's Romeo and Juliet (shortened to Romeo + Juliet) is a 1996 American romantic crime film directed, co-produced, and co-written by Baz Luhrmann, co-produced by Gabriella Martinelli, and co-written by Craig Pearce, being an adaptation and modernization of William Shakespeare's tragedy Romeo and Juliet. The film stars Leonardo DiCaprio and Claire Danes in the leading roles of Romeo and Juliet, who instantly fall in love when Romeo crashes a party and meets her, despite being members of feuding families. Brian Dennehy, John Leguizamo, Pete Postlethwaite, Paul Sorvino, and Diane Venora star in supporting roles.\nWhile it retains the original Shakespearean dialogue, the film represents the Montagues and the Capulets as warring mafia empires (with legitimate business fronts) during contemporary America, and swords are replaced with guns (with brand names such as \"Dagger\" and \"Sword\"). Some characters' names are also changed. Lord and Lady Montague and Lord and Lady Capulet are given first names (in the original, their first names are never mentioned); Friar Laurence becomes Father Laurence, and Prince Escalus is renamed Captain Prince, the police chief of Verona Beach. The adaptation eliminates the character of Friar John, and some characters change families: in the original, Gregory and Sampson are Capulets, but in the film, they are Montagues (Abram, as Abra, and Petruchio, conversely, are shifted from the Montague to the Capulet family). In addition, a few plot details are shifted, most notably toward the ending.\nThe film was released on November 1, 1996 by 20th Century Fox to commercial success, and was met with generally positive reviews. The film grossed over $147.5 million over a $14.5 million budget. At the 47th Berlin International Film Festival in 1997, DiCaprio won the Silver Bear for Best Actor and Luhrmann won the Alfred Bauer Prize. Luhrmann was also nominated for the Golden Bear Award for Best Picture. At the 69th Academy Awards, Catherine Martin and Brigitte Broch were nominated for Best Art Direction/Set Decoration. In 2005, the film was included on the BFI list of the 50 films you should see by the age of 14.", "wiki_page_id": 202652, "imdb_id": "tt0117509"}