{"text": "American director, screenwriter, and producer Paul Thomas Anderson has directed eight feature-length films, five short films, sixteen music videos, one documentary, one television episode as a guest segment director, and one theatrical play. He made his directorial debut with the mockumentary short film The Dirk Diggler Story (1988), at the age of 18, about a pornographic actor in the 1970s. Anderson followed it five years later with another short film, Cigarettes & Coffee in 1993. In 1996, Anderson wrote and directed the neo-noir crime thriller Hard Eight, starring Philip Baker Hall, John C. Reilly, Gwyneth Paltrow, and Samuel L. Jackson. The film was well received. Using the basis of The Dirk Diggler Story, Anderson wrote and directed an expansion of the film entitled Boogie Nights in 1997. The film starred Mark Wahlberg as Eddie Adams/\"Dirk Diggler\" during the Golden Age of Porn in the 1970s and his eventual downfall in the 1980s. Boogie Nights received acclaim from critics and was a commercial success; at the 70th Academy Awards ceremony, the film was nominated for three Academy Awards, including for Best Supporting Actor (Burt Reynolds), Best Supporting Actress (Julianne Moore) and Best Original Screenplay.His 1999 ensemble piece Magnolia followed four intertwined and peculiar stories in the San Fernando Valley. The film was another critical success for Anderson and at the 72nd Academy Awards, the film was nominated for three Academy Awards, including for Best Actor in a Supporting Role (Tom Cruise), Best Original Song for \"Save Me\" by Aimee Mann and Best Original Screenplay. Three years later, he directed the romantic comedy-drama Punch-Drunk Love (2002), starring Adam Sandler as a man with seven overbearing sisters who suffers from anger issues. After a five-year absence, he directed the epic historical drama There Will Be Blood (2007), inspired by Upton Sinclair's novel Oil!. The critically acclaimed film won numerous awards including Best Actor for star Daniel Day-Lewis at the Academy Awards. It was also nominated for seven Academy Awards. In 2012, he directed the drama The Master starring Joaquin Phoenix and Philip Seymour Hoffman. The film's fictional movement \"The Cause\" was widely compared to the real-life religion of Scientology in the media, despite not directly referencing it.Anderson adapted Thomas Pynchon's 2009 novel Inherent Vice into a film of the same name in 2014. Joaquin Phoenix starred in the film as Larry \"Doc\" Sportello, a stoner hippie and private investigator investigating a case involving the disappearance of his ex-girlfriend and her wealthy boyfriend. In 2015, he directed the documentary Junun about the making of album of the same name in Mehrangarh Fort, Rajasthan, India by the Israeli composer Shye Ben Tzur, English composer and Radiohead guitarist Jonny Greenwood, Indian ensemble the Rajasthan Express, and Radiohead producer Nigel Godrich. Phantom Thread (2017), starred Day-Lewis as a renowned dressmaker in the 1950s. The film was nominated for six Academy Awards. Anderson has also directed music videos for such artists as Fiona Apple, Aimee Mann, Joanna Newsom, and Radiohead.", "wiki_page_id": 39951210, "imdb_id": "tt0175880"}