{"text": "\n\nDilwale Dulhania Le Jayenge (English: The Big-Hearted Will Take Away the Bride), also known by the initialism DDLJ, is an Indian romance film, directed by Aditya Chopra (in his directorial debut), produced by his father Yash Chopra, and written by Javed Siddiqui with Aditya Chopra. Released on 20 October 1995, the film stars Shah Rukh Khan and Kajol. The plot revolves around Raj and Simran, two young non-resident Indians, who fall in love during a vacation through Europe with their friends. Raj tries to win over Simran's family so the couple can marry, but Simran's father has long since promised her hand to his friend's son. The film was shot in India, London and Switzerland, from September 1994 to August 1995.\nEarning ₹1.06 billion (valued at about US$32,766,000 in 1995) in India and ₹160 million (valued at about US$4,946,000 in 1995) overseas, Dilwale Dulhania Le Jayenge became the highest grossing Bollywood film of the year, and one of the most successful Indian films of all time. It won 10 Filmfare Awards, the most for a single film at that time, and won the National Film Award for Best Popular Film Providing Wholesome Entertainment. Its soundtrack album became one of the most popular of the 1990s.\nMany critics praised the film, which connected with different segments of society by simultaneously promoting strong family values and the following of one's own heart. Its success led other film makers to target the non-resident Indian audience, which was deemed more lucrative for them. It spawned many imitations of its story and style, and homages to specific scenes. Dilwale Dulhania Le Jayenge was one of only three Hindi films in the reference book 1001 Movies You Must See Before You Die, and was placed twelfth on the British Film Institute's list of top Indian films of all time. It is the longest-running film in the history of Indian cinema. As of 2018, over 20 years after its first release, it is still being shown at the Maratha Mandir theatre in Mumbai.\n", "wiki_page_id": 274258, "imdb_id": "tt0112870"}