{"text": "\n\nThe Devil Wears Prada is a 2006 American comedy film based on Lauren Weisberger's 2003 novel of the same name. This screen adaptation stars Meryl Streep as Miranda Priestly, a powerful fashion magazine editor, and Anne Hathaway as Andrea (Andy) Sachs, a college graduate who goes to New York City and lands a job as Priestly's co-assistant. Emily Blunt and Stanley Tucci co-star as co-assistant Emily Charlton and art director Nigel, respectively.\nAdrian Grenier, Simon Baker, and Tracie Thoms play key supporting roles. Wendy Finerman produced and David Frankel directed the film, which was distributed by 20th Century Fox. Streep's performance drew critical acclaim and earned her many award nominations, including her record-setting 14th Oscar bid, as well as the Golden Globe for Best Actress in a Comedy or Musical. Blunt also drew favorable reviews and nominations for her performance, as did many of those involved in the film's production.\nThe film was well received by both film critics and the public and became a surprise summer box-office hit following its June 30 North American release. The commercial success and critical praise for Streep's performance continued in foreign markets with the film leading the international box office for most of October. Likewise, the U.S. DVD release was the top rental during December. The film finished in 2006's Top 20 both in the U.S. and overseas and grossed over $300 million, mostly from its international run.\nAlthough the movie is set in the fashion world, most designers and other fashion notables avoided appearing as themselves for fear of displeasing U.S. Vogue editor Anna Wintour, who is widely believed to have been the inspiration for Priestly. Still, many allowed their clothes and accessories to be used in the film, making it one of the most expensively costumed films in history. Wintour later overcame her initial skepticism, saying she liked the film and Streep in particular.", "wiki_page_id": 4597853, "imdb_id": "tt0458352"}