{"text": "\n\nTeam America: World Police is a 2004 American political satire action comedy film directed by Trey Parker and written by Parker, Matt Stone and Pam Brady, all of whom are also known for the popular animated television series South Park. Starring Parker, Stone, Kristen Miller, Masasa Moyo, Daran Norris, Phil Hendrie, Maurice LaMarche, Chelsea Marguerite, Jeremy Shada and Fred Tatasciore the film is a satire of big-budget action films and their associated clichés and stereotypes, with particular humorous emphasis on the global implications of the politics of the United States. The title is derived from domestic and international political criticisms that the foreign policy of the United States frequently and unilaterally tries to \"police the world\". Featuring a cast of supermarionettes, Team America depicts a paramilitary police known as \"Team America: World Police\", who attempt to save the world from a terrorist plot by Kim Jong-il.\nThe use of marionettes instead of actors in an action film is a reference to Thunderbirds, a popular 1960s British television show, although Stone and Parker were not fans of that show. The duo worked on the script with former South Park writer Brady for nearly two years. The film had a troubled time in production, with various problems regarding the marionettes, as well as the scheduling extremes of having the film come out in time. In addition, the filmmakers fought with the Motion Picture Association of America, who returned the film over nine times with an NC-17 rating. The film was recut by a few seconds and rated R for \"graphic crude and sexual humor, violent images and strong language - all involving puppets\".\nThe film premiered at the Denver Film Festival on October 14, 2004, and was released theatrically in the United States the following day on October 15, 2004 by Paramount Pictures. It has received mostly positive reviews from critics and grossed over $52.1 million worldwide against its $32 million budget.", "wiki_page_id": 900231, "imdb_id": "tt0372588"}