{"text": "The Joan Crawford filmography lists the film appearances of American actress Joan Crawford who starred in numerous motion pictures throughout a lengthy career that spanned nearly five decades.\nShe made her film debut in Lady of the Night (1925), as a body double for film star Norma Shearer. She appeared in several other films before she made her major breakthrough playing Lon Chaney's love interest in the 1927 horror film, The Unknown. Her major success in Our Dancing Daughters (1928) made her a popular flapper of the late 1920s. Her first sound film, Untamed (1929), was a critical and box office success.\nCrawford would become a highly popular actress throughout the 1930s, as a leading lady for Metro-Goldwyn-Mayer. She starred in a series of \"rags-to-riches\" films that were extremely popular during the Depression-era, most especially with women. Her popularity rivaled fellow MGM actresses, including Greta Garbo, Norma Shearer, and Jean Harlow. She appeared in eight movies with Clark Gable, including romantic drama Possessed (1931), musical film Dancing Lady (1933), romantic comedy Love on the Run (1936), and romantic drama Strange Cargo (1940) among others. In 1937, she was proclaimed the first \"Queen of the Movies\" by Life magazine, but her popularity soon waned. In May 1938, after her films The Bride Wore Red (1937) and Mannequin (1938) proved to be expensive failures, Crawford—along with Greta Garbo, Katharine Hepburn, Fred Astaire, and Kay Francis and many others—was labeled \"Box Office Poison\", an actor whose \"box office draw is nil\".\nCrawford managed to make a comeback in the comedy The Women (1939) opposite an all-star female cast. On July 1, 1943, Crawford left MGM and signed an exclusive contract with Warner Brothers, where she became a rival of Bette Davis. After a slow start with the studio, she received critical and commercial acclaim for her performance in drama Mildred Pierce (1945). The film earned her an Academy Award for Best Actress. From 1946 to 1952, Crawford appeared in a series of critical and box office successes, including the musical drama Humoresque (1946); film noirs Possessed (1947, for which she received a second Academy Award nomination) and Flamingo Road (1949); drama The Damned Don't Cry (1950); and romantic comedy Goodbye, My Fancy (1951), among others. She received a third and final Academy Award nomination for her performance in the thriller Sudden Fear (1952).\nIn 1953, Crawford starred in the musical Torch Song, her final film role for MGM. Her next film Johnny Guitar (1954), although not a major hit, is one of Crawford’s most popular films among her fans. During the latter half of the 1950s, Crawford starred in a series of B movies, including romantic dramas Female on the Beach (1955) and Autumn Leaves (1956). In 1962, Crawford was teamed with Bette Davis in a film adaptation of What Ever Happened to Baby Jane? The thriller film was a box office hit and briefly revived Crawford's career. Her final film performance was in the British science-fiction film, Trog (1970).\n", "wiki_page_id": 3988853, "imdb_id": "tt0026778"}