{"text": "\n\nDas Boot (German pronunciation: [das ˈboːt], German: \"The Boat\") is a 1981 German war film written and directed by Wolfgang Petersen, produced by Günter Rohrbach, and starring Jürgen Prochnow, Herbert Grönemeyer, and Klaus Wennemann. It has been exhibited both as a theatrical release and as a TV miniseries (1985), in several different home video versions of various running times, and in a director's cut version supervised by Petersen in 1997.\nAn adaptation of Lothar-Günther Buchheim's 1973 German novel of the same name, the film is set during World War II and tells the fictional story of U-boat U-96 and its crew, as they set out on yet another hazardous patrol in the Battle of the Atlantic. It depicts both the excitement of battle and the tedium of the fruitless hunt, and shows the men serving aboard U-boats as ordinary individuals with a desire to do their best for their comrades and their country. \nDevelopment began in 1979. Several American directors were considered three years earlier before the film was shelved. During production, Heinrich Lehmann-Willenbrock, the captain of the real U-96 and one of Germany's top U-boat \"tonnage aces\" during the war, and Hans-Joachim Krug, former first officer on U-219, served as consultants. One of Petersen's goals was to guide the audience through \"a journey to the edge of the mind\" (the film's German tagline Eine Reise ans Ende des Verstandes), showing \"what war is all about\".\nProduced with a budget of 32 million DM (about $18.5 million), the film's high production cost ranks it among the most expensive films in the history of German cinema. It was the second most expensive up until that time, after Metropolis. The film enjoyed financial success and grossed over $80 million worldwide. Columbia Pictures released both German version and English-dubbed version in the United States theatrically, but the film's German version actually grossed much higher than the English-dubbed version at the United States box office.  The film received highly positive reviews and was nominated for six Academy Awards, two of which (for Best Director and Best Adapted Screenplay) went to Petersen himself; he was also nominated for a BAFTA Award and DGA Award. Today, the film is seen as one of the greatest of all German films.\n", "wiki_page_id": 8994, "imdb_id": "tt0082096"}