{"text": "\n\nEdge of Tomorrow (also known by its marketing tagline Live. Die. Repeat. and renamed as such on home release) is a 2014 American science fiction action film starring Tom Cruise and Emily Blunt. Doug Liman directed the film based on a screenplay adapted from the 2004 Japanese light novel All You Need Is Kill by Hiroshi Sakurazaka. The film takes place in a future where most of Europe is invaded by an alien race. Major William Cage (Cruise), a public relations officer with no combat experience, is forced by his superiors to join a landing operation against the aliens. Though Cage is killed in combat, he finds himself in a time loop that sends him back to the day preceding the battle every time he dies. Cage teams up with Special Forces warrior Rita Vrataski (Blunt) to improve his fighting skills through the repeated days, seeking a way to defeat the extraterrestrial invaders.\nIn late 2009, 3 Arts Productions purchased the rights to the novel and sold a spec script to the American studio Warner Bros. The studio produced the film with the involvement of 3 Arts, the novel's publisher Viz Media, and Australian production company Village Roadshow. Filming began in late 2012, taking place in England at Leavesden Studios outside London, and other locations such as Trafalgar Square and Saunton Sands. Nine companies handled the visual effects.\nThe film was released in cinemas on the weekend of May 30, 2014 in 28 territories, including the United Kingdom, Brazil, Germany, Spain, and Indonesia. On the weekend of June 6, 2014 it was released in 36 additional territories, including North America (United States and Canada), Australia, China, and Russia. The film received positive reviews from critics and was a box office success, grossing over $370 million in theaters worldwide, the ninth-highest-grossing film in Tom Cruise's career thus far. A sequel, titled Live Die Repeat and Repeat, is currently in development.\n", "wiki_page_id": 37098299, "imdb_id": "tt1631867"}