{"text": "\n\nMongol (Монгол), also known as Mongol: The Rise of Genghis Khan in the United States and Mongol: The Rise to Power of Genghis Khan in the United Kingdom, is a 2007 semi-historical epic film directed by Sergei Bodrov, about the early life of Temüjin, who later came to be known as Genghis Khan. The storyline was conceived from a screenplay written by Bodrov and Arif Aliev. It was produced by Bodrov, Sergei Selyanov and Anton Melnik and stars Tadanobu Asano, Sun Honglei and Chuluuny Khulan in the main roles. Mongol explores abduction, kinship and the repercussions of war.The film was a co-production between companies in Russia, Germany and Kazakhstan. Filming took place mainly in the People's Republic of China, principally in Inner Mongolia (the Mongol autonomous region), and in Kazakhstan. Shooting began in September 2005, and was completed in November 2006. After an initial screening at the Russian Film Festival in Vyborg on 10 August 2007, Mongol was released in Russia on 20 September 2007. It saw a limited release in the United States on 6 June 2008 grossing $5.7 million in domestic ticket sales. It additionally earned nearly 21 million in sales through international release for a combined $26.5 million in gross revenue. The film was a minor financial success after its theatrical run, and was generally met with positive critical reviews. The film was nominated for the 2007 Academy Award for Best Foreign Language Film as a submission from Kazakhstan.The film is intended to be the first part of a trilogy about Genghis Khan, and initial work on the second part began in 2008. The trilogy project was eventually put on the shelf, but in July 2013, during a visit to the annual Naadam Festival in Ulan Bator, Bodrov told the press that the production of the sequel had started, and that it may be shot in Mongolia, as had been the intention for Mongol, before local protests, fearing that the film would not correctly portray the Mongolian people and its national hero, Genghis Khan, caused the shooting to move to Inner Mongolia and Kazakhstan.", "wiki_page_id": 13310698, "imdb_id": "tt0416044"}