{"text": "\n\nSaw VI is a 2009 American horror film directed by Kevin Greutert from a screenplay written by Patrick Melton and Marcus Dunstan. It is the sixth installment in the Saw franchise and stars Tobin Bell, Costas Mandylor, Betsy Russell, Mark Rolston, Peter Outerbridge, and Shawnee Smith. It was produced by Mark Burg and Oren Koules of Twisted Pictures and distributed by Lionsgate.\nSaw VI continues the franchise's focus on the posthumous effects of the Jigsaw Killer and the progression of his successor, Mark Hoffman. In this film, Hoffman sets a series of traps for an insurance executive, William Easton, and his employees. Meanwhile, the FBI trails Peter Strahm, now suspected of being Jigsaw's last accomplice, and Hoffman is drawn into motion to protect his secret identity.\nGreutert, who served as editor for all the previous Saw films, made his directorial debut with Saw VI. Melton and Dunstan, the writers for both Saw IV and Saw V, returned to write the screenplay and Charlie Clouser, who provided the score for all previous Saw films, composed the score. Filming took place in Toronto from March to May 2009 with a budget of $11 million.\nThe film was released in New Zealand and Australia on October 22, 2009, and in the United States and Canada on October 23, 2009. In Spain it was the first film to receive a Película X rating for violence (a rating usually reserved for pornographic films); the rating restricted screenings to eight select theaters in that country. It was released almost a year later on October 8, 2010 in Spain with an \"18\" rating, after the producers had the offensive content edited out, according to the rating board. With gross receipts of $14 million in its opening weekend, Saw VI placed second to Paranormal Activity's $21 million. Saw VI went on to gross over $68 million worldwide, the lowest-grossing Saw film to date, but still a financial success compared to its small budget. Reviews were mixed, with some criticizing the acting and others praising Greutert's directing and the film's contribution to the debate on healthcare reform in the United States.\n", "wiki_page_id": 19844891, "imdb_id": "tt1233227"}