{"text": "\n\nThe Hunger Games: Mockingjay – Part 1 is a 2014 American dystopian science fiction adventure film directed by Francis Lawrence with a screenplay by Peter Craig and Danny Strong. It is the first of two films based on Suzanne Collins' novel  Mockingjay, the final book in The Hunger Games trilogy, and the third installment in The Hunger Games film series, produced by Nina Jacobson and Jon Kilik and distributed by Lionsgate. The film features an ensemble cast that includes Jennifer Lawrence, Josh Hutcherson, Liam Hemsworth, Woody Harrelson, Elizabeth Banks, Julianne Moore, Philip Seymour Hoffman, Jeffrey Wright, Stanley Tucci, and Donald Sutherland. Principal photography for both parts of the film began on September 23, 2013, in Atlanta, before moving to Paris for two weeks of filming and officially concluding on June 20, 2014, in Berlin.The story continues to follow Katniss Everdeen; having twice survived the Hunger Games, Katniss finds herself in District 13. Under the leadership of President Coin and the advice of her trusted friends, Katniss reluctantly becomes the symbol of a mass rebellion against the Capitol and fights to save Peeta and a nation moved by her courage. It is the sequel to The Hunger Games: Catching Fire and was followed by the concluding entry, The Hunger Games: Mockingjay – Part 2.\nMockingjay – Part 1 was released on November 21, 2014 in the United States. Like its predecessors, the film was a commercial success grossing $55 million on its opening day, making it the largest opening day of 2014 and the sixth-largest in November. The film went to the No. 1 spot during its opening weekend with a $273.8 million worldwide gross, becoming the biggest opening of 2014 and marking The Hunger Games film series as the only franchise to have three films earn over $100 million in a weekend. The film earned over $755 million worldwide, making it the fifth highest-grossing film of 2014 and the second-highest-grossing entry in The Hunger Games series.\nPart 1 received generally positive reviews from critics, who commended its acting and political subtext, but received criticism for its lack of action and for splitting the novel into two separate adaptations. It is the lowest-rated Hunger Games film of the franchise, according to review aggregator Rotten Tomatoes. The film had garnered a nomination for Best Science Fiction Film at the 41st Saturn Awards. For her performance, Lawrence received a nomination for Best Actress in an Action Movie at the 20th Critics' Choice Awards and a Saturn Award nomination. The song \"Yellow Flicker Beat\" also received a nomination for Best Original Song at the 72nd Golden Globe Awards and Critics' Choice Awards.\n", "wiki_page_id": 39526507, "imdb_id": "tt1951265"}