{"text": "\n\nChristopher J Morris (born 15 June 1962) is an English comedian, writer, director, actor, voice actor, and producer. He is known for his black humour, surrealism, and controversial subject matter, and has been hailed for his \"uncompromising, moralistic drive\" by the British Film Institute.In the early 1990s, Morris teamed up with his radio producer, Armando Iannucci, to create On the Hour, a satire of news programmes. This was expanded into a television spin off, The Day Today, which launched the career of Steve Coogan, and has since been hailed as one of the most important satirical shows of the 1990s. Morris further developed the satirical news format with Brass Eye, which lampooned celebrities whilst focusing on themes such as crime and drugs. For many, the apotheosis of Morris' career was a Brass Eye special, which dealt with the moral panic surrounding paedophilia. It quickly became one of the most complained about programmes in British television history, leading the Daily Mail to describe him as \"the most loathed man on TV\".Meanwhile, Morris' postmodern sketch and ambient music radio show Blue Jam helped him to gain a cult following. He went on to win a BAFTA for Best Short Film after expanding a Blue Jam sketch into My Wrongs 8245–8249 & 117, which starred Paddy Considine. Blue Jam was adapted into the TV series Jam. This was followed by Nathan Barley, a sitcom written in collaboration with a then little-known Charlie Brooker that satirised hipsters, which had low ratings but found success upon its DVD release. Morris followed this by joining the cast of the Graham Linehan sitcom The IT Crowd, his first project in which he did not have writing or producing input.\nIn 2010, Morris directed his first feature-length film, Four Lions, which satirised Islamic terrorism through a group of inept British Pakistanis. Reception of the film was largely positive, earning Morris his second BAFTA, for \"Outstanding Debut\". Since 2012, he has directed four episodes of Iannucci's political comedy Veep and appeared onscreen in The Double and Stewart Lee's Comedy Vehicle.\n", "wiki_page_id": 5397, "imdb_id": "tt1341167"}