{"text": "\n\nThe Frighteners is a 1996 New Zealand-American horror comedy film directed by Peter Jackson and co-written with his partner, Fran Walsh. The film stars Michael J. Fox, Trini Alvarado, Peter Dobson, John Astin, Dee Wallace Stone, Jeffrey Combs, R. Lee Ermey and Jake Busey. The Frighteners tells the story of Frank Bannister (Fox), an architect who develops psychic abilities allowing him to see, hear, and communicate with ghosts after his wife's murder. He initially uses his new abilities to befriend ghosts, whom he sends to haunt people so that he can charge them handsome fees for \"exorcising\" the ghosts. However, the spirit of a mass murderer appears able to attack the living and the dead, posing as the ghost of the Grim Reaper, prompting Frank to investigate the supernatural presence.\nJackson and Walsh conceived the idea for The Frighteners during the script-writing phase of Heavenly Creatures. Executive producer Robert Zemeckis hired the duo to write the script, with the original intention of Zemeckis directing The Frighteners as a spin-off film of the television series, Tales from the Crypt. With Jackson and Walsh's first draft submitted in January 1994, Zemeckis believed the film would be better off directed by Jackson, produced by Zemeckis and funded/distributed by Universal Studios. The visual effects were created by Jackson's Weta Digital, which had only been in existence for three years. This, plus the fact that The Frighteners required more digital effects shots than almost any movie made until that time, resulted in the eighteen-month period for effects work by Weta Digital being largely stressed.\nDespite a rushed post-production schedule, Universal was so impressed with Jackson's rough cut on The Frighteners, the studio moved the theatrical release date closer by four months. The film was not a box office success, but received generally positive reviews from critics. Despite its lackluster performance at the box office, the film has gained a cult following in more recent years.\nThe Frighteners is also Fox's last leading role in a live-action feature film; Fox then went on to a four-year run on the television series Spin City before semi-retiring in 2000 due to the effects of Parkinson's disease.\n", "wiki_page_id": 768808, "imdb_id": "tt0116365"}