{"text": "\n\nShrek is a 2001 American computer-animated, comedy film loosely based on the 1990 fairytale picture book of the same name by William Steig. Directed by Andrew Adamson and Vicky Jenson in their directorial debuts, it stars Mike Myers, Eddie Murphy, Cameron Diaz, and John Lithgow as the voices of the lead characters. The film parodies other films adapted from fairy tale storylines, primarily aimed at animated Disney films. In the story, Shrek (Myers) finds his swamp overrun by fairy tale creatures who have been banished by a corrupt Lord Farquaad (Lithgow) aspiring to be king. Shrek makes a deal with Farquaad to regain control of his swamp in return for rescuing Princess Fiona (Diaz), whom he intends to marry. With the help of Donkey (Murphy), Shrek embarks on his quest but soon falls in love with the princess, who is hiding a secret that will change his life forever.\nThe rights to Steig's book were purchased by Steven Spielberg in 1991. He originally planned to produce a traditionally-animated film based on the book, but John H. Williams convinced him to bring the film to the newly-founded DreamWorks in 1994. Jeffrey Katzenberg began active development of the film in 1995 immediately following the studio's purchase of the rights from Spielberg. Chris Farley was originally cast as the voice for the title character, recording nearly all of the required dialogue. After Farley died in 1997 before the work was finished, Mike Myers stepped in to voice the character, which was changed to a Scottish accent in the process. The film was intended to be motion-captured, but after poor results, the studio decided to hire Pacific Data Images to complete the final computer animation.\nShrek was released in the United States on May 16, 2001, and grossed $484.4 million worldwide against production budget of $60 million. It was widely acclaimed as an animated film that featured adult-oriented humor and themes, while catering to children at the same time. Shrek won the first ever Academy Award for Best Animated Feature and was also nominated for Best Adapted Screenplay. It also earned six award nominations from the British Academy of Film and Television Arts (BAFTA), winning the BAFTA award for Best Adapted Screenplay. The film's success helped establish DreamWorks Animation as a prime competitor to Pixar in feature film computer animation, and three sequels were released—Shrek 2 (2004), Shrek the Third (2007), and Shrek Forever After (2010)—along with two holiday specials, a spin-off film, and a stage musical that kickstarted the Shrek franchise. A planned fifth film was cancelled in 2009 prior to the fourth film's release, but it has since been revived and has entered development.", "wiki_page_id": 18717177, "imdb_id": "tt0126029"}