{"text": "\n\nThe Princess and the Frog is a 2009 American animated musical film produced by Walt Disney Animation Studios and released by Walt Disney Pictures. The 49th Disney animated feature film, the film is loosely based on the novel The Frog Princess by E. D. Baker, which is in turn based on the Brothers Grimm fairy tale \"The Frog Prince\". Written and directed by Ron Clements and John Musker, the film features an ensemble voice cast that stars Anika Noni Rose, Bruno Campos, Keith David, Michael-Leon Wooley, Jennifer Cody, and Jim Cummings, with Peter Bartlett, Jenifer Lewis, Oprah Winfrey, Terrence Howard, and John Goodman. Set in 1920s New Orleans, the film tells the story of a hardworking waitress named Tiana who dreams of owning her own restaurant. After kissing a prince who has been turned into a frog by an evil voodoo sorcerer, Tiana becomes a frog herself and must find a way to turn back into a human before it is too late.\nThe Princess and the Frog began production under the working title The Frog Princess. It marked Disney's return to traditional animation, as it was the studio's first traditionally animated film since Home on the Range (2004). Co-directors Ron Clements and John Musker, directors of Disney's highly successful films The Little Mermaid (1989) and Aladdin (1992), returned to Disney to direct The Princess and the Frog. The studio returned to a Broadway musical-style format frequently used during the Disney Renaissance, and features music written by composer Randy Newman, well known for his musical involvement in Pixar films such as A Bug's Life (1998), Monsters, Inc. (2001), Cars (2006), and the Toy Story trilogy (1995, 1999, and 2010). The film also marked the return of Disney animated musical films based on well-known stories since the Disney Renaissance.\nThe Princess and the Frog opened in limited release in New York and Los Angeles on November 25, 2009, and in wide release on December 11, 2009. The film was successful at the box office, ranking first place on its opening weekend in North America, and grossing $267 million worldwide. It received three Academy Award nominations at the 82nd Academy Awards: one for Best Animated Feature and two for its achievement in music (Original Song). It lost to Up and Crazy Heart, respectively.", "wiki_page_id": 6141751, "imdb_id": "tt0780521"}