{"text": "\n\nPocahontas is a 1995 American animated musical romantic drama film produced by Walt Disney Feature Animation for Walt Disney Pictures. The 33rd Disney animated feature film, it was directed by Mike Gabriel and Eric Goldberg and is loosely based on the life of the Native American woman of the same name. It portrays a fictionalized account of her historical encounter with Englishman John Smith and the Jamestown settlers that arrived from the Virginia Company. The voice cast stars Irene Bedard and Mel Gibson as Pocahontas and Smith, respectively, with David Ogden Stiers, Russell Means, Christian Bale, Billy Connolly, and Linda Hunt. The score was written by Alan Menken, who also wrote the film's songs with Stephen Schwartz.\nAfter making his directorial debut with The Rescuers Down Under (1990), Gabriel conceived the film during a Thanksgiving weekend. The project went into development concurrently with The Lion King (1994) and attracted most of Disney's top animators. Meanwhile, Disney studio chairman Jeffrey Katzenberg decided the film should be a serious romantic epic in the vein of Beauty and the Beast (1991), in hope that, like Beauty,  it would also be nominated for the Academy Award for Best Picture. Screenwriters Carl Binder, Susannah Grant, and Philip LaZebnik took creative liberties with history in an attempt to make the film palatable to audiences.\nPocahontas was released on June 23, 1995 to mixed reactions from reviewers, who praised its animation but criticized its story; the film's racial overtones and historical inaccuracy also garnered a mix of condemnation and praise. Pocahontas earned $346 million at the box office and its gross was seen as a disappointment compared to that of The Lion King. The film received two Academy Awards for Best Musical or Comedy Score for Menken and Best Original Song for \"Colors of the Wind\". A video game based on the film was released across various platforms, and the film itself was followed by a direct-to-video sequel titled Pocahontas II: Journey to a New World in 1998. Critics have noted the influence that Pocahontas had on subsequent films.\n", "wiki_page_id": 399433, "imdb_id": "tt0114148"}