{"text": "\n\nSunshine is a 2007 science fiction thriller film directed by Danny Boyle and adapted from a screenplay written by Alex Garland. The story takes place in the year 2057, and follows a group of astronauts on a dangerous mission to reignite the dying Sun. The ensemble cast features Cillian Murphy, Chris Evans, Rose Byrne, Michelle Yeoh, Cliff Curtis, Troy Garity, Hiroyuki Sanada, Benedict Wong, and Chipo Chung. The director cast a group of international actors for the film, and had the actors live together and learn about topics related to their roles, as a form of method acting. \nThe film was a co-production between the motion picture studios of Moving Picture Company, DNA Films, UK Film Council, and Ingenious Film Partners. Theatrically, it was commercially distributed by Fox Searchlight Pictures, while the 20th Century Fox Home Entertainment division released the film in the video rental market. Sunshine explores physics, science and religion. Following its wide release in theatres, the film garnered several award nominations for its acting, directing, and production merits. It also won an award for Best Technical Achievement for production designer Mark Tildesley from the British Independent Film Awards. The film score was orchestrated by musician John Murphy. The soundtrack was released by the Fox Music Group label on 25 November 2008.\nPrevious science fiction films that Boyle cited as influences included Stanley Kubrick's 1968 film 2001: A Space Odyssey, Andrei Tarkovsky's 1972 film Solaris, and Ridley Scott's 1979 science-fiction horror film Alien. Sunshine was released in the United Kingdom on 6 April 2007 and in the United States on 20 July 2007. The film took £3.2 million in the UK over twelve weeks, and in the USA it was placed no. 13 in the box office on the first weekend of its wide release. With a budget of US$40 million, it ultimately grossed US$32 million worldwide. Although the film was not considered a box office success, preceding its initial screening to the public the film was generally met with positive critical reviews. Widescreen DVD and Blu-ray editions of the film, also including the hi-definition theatrical trailer, scene selections, and director's commentary among other highlights, were released in the United States on 8 January 2008.\n", "wiki_page_id": 3252860, "imdb_id": "tt0448134"}