{"text": "\n\nThe Simpsons Movie is a 2007 American animated comedy film based on the Fox television series The Simpsons. The film was directed by David Silverman, and stars the regular television cast of Dan Castellaneta, Julie Kavner, Nancy Cartwright, Yeardley Smith, Hank Azaria, Harry Shearer, Tress MacNeille, Pamela Hayden, Maggie Roswell and Russi Taylor, as well as Albert Brooks. The film follows Homer Simpson, whose irresponsibility gets the best of him when he pollutes the lake in Springfield after the town has cleaned it up following receipt of a warning from the Environmental Protection Agency. As the townspeople exile him and eventually his family abandons him, Homer works to redeem his folly by stopping Russ Cargill, the head of the EPA, who intends to destroy Springfield.\nAlthough previous attempts to create a Simpsons film had been made, they failed due to the lack of a script of appropriate length and production crew members. Eventually in 2001, producers James L. Brooks, Matt Groening, Al Jean, Richard Sakai and Mike Scully began development of the film, and a writing team consisting of Brooks, Groening, Jean, Scully, Ian Maxtone-Graham, George Meyer, David Mirkin, Mike Reiss, Matt Selman, John Swartzwelder and Jon Vitti was assembled. They conceived numerous plot ideas, with Groening's being the one developed into a film. The script was re-written over a hundred times, and this rewriting continued after the animation had begun in 2006. Consequently, hours of finished material was cut from the final release, including cameo roles from Erin Brockovich, Minnie Driver, Isla Fisher, Kelsey Grammer and Edward Norton; Tom Hanks and the members of Green Day appeared in the final cut as themselves.\nTie-in promotions were made with several companies to promote the film's release, including Burger King and 7-Eleven, the latter of which transformed selected stores into Kwik-E-Marts. The film premiered in Springfield, Vermont on July 21, 2007, and was released six days later by 20th Century Fox in the United States. The Simpsons Movie was a critical and commercial success, grossing over $527 million worldwide, making it the eighth highest-grossing film of 2007 and the highest-ever grossing film based on an animated television series.\n\n", "wiki_page_id": 1424178, "imdb_id": "tt0462538"}