{"text": "\n\nTodd Haynes (; born January 2, 1961) is an American independent film director, screenwriter, and producer. He is considered a pioneer of the New Queer Cinema movement of filmmaking that emerged in the early 1990s. Haynes first gained public attention with his controversial short film Superstar: The Karen Carpenter Story (1987), which chronicles singer Karen Carpenter's tragic life and death, using Barbie dolls as actors. Haynes had not obtained proper licensing to use the Carpenters' music, prompting a lawsuit from Richard Carpenter, whom the film portrayed in an unflattering light, banning the film's distribution. Superstar became a cult classic.Haynes' feature directorial debut, Poison (1991), a provocative, three-part exploration of AIDS-era queer perceptions and subversions, established him as a formidable talent and figure of a new transgressive cinema. Poison won the Sundance Film Festival's Grand Jury Prize and is regarded as a seminal work of New Queer Cinema. Haynes received further acclaim for his second feature film Safe (1995), a symbolic portrait of a housewife who develops extreme allergic reactions to her suburban life. Safe was later voted the best film of the 1990s by The Village Voice Film Poll. Haynes' next feature, Velvet Goldmine (1998), is a tribute to the 1970s glam rock era, drawing heavily on the rock histories and mythologies of David Bowie, Iggy Pop, and Lou Reed. The film received the Special Jury Prize for Best Artistic Contribution at the 1998 Cannes Film Festival and an Academy Award nomination for Best Costume Design.\nHaynes gained critical acclaim and a measure of mainstream success with his 2002 feature, Far from Heaven. Inspired by the cinematic language of the films of Douglas Sirk, Far From Heaven is a 1950s-set melodrama about a Connecticut housewife who discovers that her husband is gay and falls in love with her African-American gardener. The film received four Academy Award nominations, including Best Original Screenplay for Haynes. His fifth feature, I'm Not There (2007), marked another shift in direction. A nonlinear biopic, I'm Not There depicts various facets of Bob Dylan through seven fictionalized characters played by five actors and an actress. I'm Not There received critical acclaim and an Academy Award nomination for Best Supporting Actress for Cate Blanchett. In 2011, Haynes directed and co-wrote Mildred Pierce, a five-hour mini-series for HBO, which garnered 21 Emmy Award nominations, winning five, as well as four Golden Globe Award nominations and a win for lead actress Kate Winslet.\nIn 2015, Haynes returned to the big screen with Carol, his sixth feature film and the first film not written by him. Based on Patricia Highsmith's seminal romance novel The Price of Salt, Carol is the story of a forbidden love affair between two women from different classes and backgrounds in early 1950s New York City. The film received critical acclaim and many accolades including six Academy Award nominations, five Golden Globe Award nominations, and nine BAFTA Award nominations.\n", "wiki_page_id": 392658, "imdb_id": "tt2402927"}