{"text": "\n\nGangs of Wasseypur – Part 1 (stylised as Gangs of वासेपुर) is a 2012  Indian Bollywood Hindi-language crime thriller film directed by Anurag Kashyap, and written by Kashyap and Zeishan Quadri. It is the first installment of the Gangs of Wasseypur series, centered on the coal mafia of Dhanbad, Jharkhand, and the underlying power struggles, politics and vengeance between three crime families. Part 1 features ensemble cast with Manoj Bajpayee, Nawazuddin Siddiqui, Richa Chadda, Huma Qureshi, Vineet Kumar Singh,  Tigmanshu Dhulia and Pankaj Tripathi in the major roles. Its story spans from the early 1940s to the mid-1990s. Both parts were originally shot as a single film measuring a total of 319 minutes and screened at the 2012 Cannes Directors' Fortnight but since no Indian theatre would volunteer to screen a five plus hour film, it was divided into two parts (160 minutes and 159 minutes respectively) for the Indian market.\nThe film received an A certification from the Indian Censor Board. The film's soundtrack is heavily influenced by traditional Indian folk songs.\nPart 1 was released on 22 June 2012 in more than 1000 theatre screens across India. It was released on 25 July in France and on 28 June in the Middle East but was banned in Kuwait and Qatar. Gangs of Wasseypur was screened at the Sundance Film Festival in January 2013.  Gangs of Wasseypur has won four nominations, including best film and best director, at the 55th Asia-Pacific Film Festival.The combined film won the\nBest Audiography, Re-recordist's of the Final Mixed Track\n(Alok De, Sinoy Joseph and Shreejesh Nair) and Special Mention for acting (Nawazuddin Siddiqui) at the 60th National Film Awards. The film collected four Filmfare Awards, including Best Film (Critics) and Best Actress (Critics), at the 58th Filmfare AwardsAlthough not a huge hit by any financial standard, the meagre combined budget of ₹18.5cr allowed the 2 films to be commercially successful, with net domestic earnings of ₹50.81cr (of the 2 parts combined). It is considered by many as a modern cult film.\n\n", "wiki_page_id": 31439778, "imdb_id": "tt1954470"}