{"text": "\n\nThe Whistleblower is a 2010  Canadian-German-American biographical crime drama film directed by Larysa Kondracki and starring Rachel Weisz. Kondracki and Eilis Kirwan wrote the screenplay, which was inspired by the story of Kathryn Bolkovac, a Nebraska police officer who was recruited as a United Nations peacekeeper for DynCorp International in post-war Bosnia and Herzegovina in 1999. While there, she discovered a sex trafficking ring serving (and facilitated by) DynCorp employees, with the UN's SFOR peacekeeping force turning a blind eye. Bolkovac was fired and forced out of the country after attempting to shut down the ring. She took the story to BBC News in the UK and won a wrongful-dismissal lawsuit against DynCorp.\nKondracki wanted her debut film to concern human trafficking, and she encountered Bolkovac's story in college. She and Kirwan struggled to obtain financial support for the project. Eight years after Kondracki decided to produce the film, she secured funding and cast Weisz in the lead role. The Whistleblower—a co-production of Canada, Germany, and the United States—was filmed in Romania from October to December 2009.\nThe Whistleblower premiered on 13 September 2010, at the Toronto International Film Festival, and Samuel Goldwyn Films distributed the film in theaters in the United States. The film was advertised as a fictionalization of events occurring during the late 1990s. Kondracki said that the facts are broadly accurate but some details were omitted for the film; for example, a three-week \"breaking-in\" period for trafficking victims was not shown. The film received mixed reviews. The performances by Weisz and her co-stars were praised, but the intense violence depicted in several scenes was debated by critics, with some calling it exploitative. Kondracki and Weisz responded that what happened in Bosnia had been toned down for the film. The Whistleblower received several awards and nominations, including three nominations at the 2012 Genie Awards. UN Secretary-General Ban Ki-moon hosted a screening of the film and promised action would be taken to prevent further instances of human trafficking. The Guardian reported that other UN officials attempted to downplay the events depicted and that initiatives against trafficking in Bosnia were aborted.\n\n", "wiki_page_id": 25245866, "imdb_id": "tt0896872"}