{"text": "\n\nSalò, or the 120 Days of Sodom (Italian: Salò o le 120 giornate di Sodoma), titled Pasolini's 120 Days of Sodom on English-language prints and commonly referred to as simply Salò (Italian: [saˈlɔ]), is a 1975 Italian-French horror art film directed by Pier Paolo Pasolini. The film is a loose adaptation of the book The 120 Days of Sodom by the Marquis de Sade reset during WWII. The film focuses on four wealthy, corrupt Italian libertines, during WWII in the time of the fascist Republic of Salò (1943–1945). The libertines kidnap eighteen teenagers and subject them to four months of extreme violence, murder, sadism and sexual and mental torture. The film explores the themes of political corruption, murder, abuse of power, sadism, perversion, sexuality and fascism. The story is in four segments, inspired by Dante's Divine Comedy: the Anteinferno, the Circle of Manias, the Circle of Excrement, and the Circle of Blood. The film also contains frequent references to and several discussions of Friedrich Nietzsche's 1887 book On the Genealogy of Morality, Ezra Pound's poem The Cantos and Marcel Proust's novel sequence In Search of Lost Time.\nThe film premiered at the Paris Film Festival on 23 November 1975, three weeks after Pasolini was murdered in Rome. It had a brief theatrical run in Italy before being banned in January 1976 and was released in the United States the following year on 3 October 1977. Because it depicts youths subjected to intensely graphic violence, relentless sadism, sexual deviance and brutal murder, the film was extremely controversial upon its release and has remained banned in several countries into the 21st century.\nThe confluence of thematic content in the film—ranging from the political and socio-historical, to psychological and sexual—has led to much critical discussion of the film. It has been both praised and decried by various film historians and critics and was named the 65th scariest film ever made by the Chicago Film Critics Association in 2006. It is also the subject of an entry in The Penguin Encyclopedia of Horror and the Supernatural (1986).", "wiki_page_id": 28623, "imdb_id": "tt0073650"}