{"text": "\n\nThe Emperor's New Groove is a 2000 American animated buddy comedy film created by Walt Disney Feature Animation and released by Walt Disney Pictures. The 40th animated Disney feature film, it was directed by Mark Dindal, produced by Randy Fullmer, written by David Reynolds, and stars David Spade, John Goodman, Eartha Kitt, Patrick Warburton and Wendie Malick. The film follows an arrogant young Incan emperor named Kuzco who is transformed into a llama by his ex-advisor, Yzma. In order for the emperor to change back into a human, he trusts a village leader named Pacha who escorts him back to the palace.\nDevelopment for the film began in 1994 where it was conceived as a musical epic titled Kingdom of the Sun. Following his directorial debut with The Lion King, Roger Allers recruited English musician Sting to compose songs for the film. Because of the underwhelming box office performances of Pocahontas and The Hunchback of Notre Dame, Mark Dindal was brought in as co-director in order to add a comedic mood. Due to poor test screenings, creative differences with Dindal, and production falling behind schedule, Allers departed the project in which the film shifted from its dramatic musical approach into a more light-hearted comedy film. A documentary about the making of the film, titled The Sweatbox, details the production troubles that the film endured during its six years of development.\nThe Emperor's New Groove was released in theaters on December 15, 2000 to positive reviews from critics. The film performed disappointingly compared to the string of successful Disney movies released in the 1990s, grossing $169 million on a $100 million budget, but later found considerably larger success in home media, where it became the top-selling release of 2001. It was nominated for an Academy Award for Best Original Song for \"My Funny Friend and Me\" performed by Sting, but lost to \"Things Have Changed\" by Bob Dylan from Wonder Boys. A direct-to-video sequel to the film, titled Kronk's New Groove, was released in 2005, and an animated television series titled The Emperor's New School aired on Disney Channel from 2006 to 2008.\n", "wiki_page_id": 338869, "imdb_id": "tt0120917"}