{"text": "\n\nJulianne Moore is an American actress who made her acting debut on television in 1984 in the mystery series The Edge of Night. The following year she made her first appearance in the soap opera As the World Turns, which earned her a Daytime Emmy Award for Outstanding Ingenue in a Drama Series in 1988. Following roles in television films, Moore had her breakthrough in Robert Altman's drama film Short Cuts (1993). Her performance garnered critical acclaim as well as notoriety for a monologue her character delivers while nude below the waist.\nAmong Moore's releases of 1995 were Todd Haynes' drama Safe and the romantic comedy Nine Months, in which she starred alongside Hugh Grant. In 1997 Moore portrayed a veteran pornographic actress in Paul Thomas Anderson's drama Boogie Nights—a role that earned her first nomination for the Academy Award for Best Supporting Actress. She also appeared in Steven Spielberg's adventure sequel The Lost World: Jurassic Park—Moore's biggest commercial success to that point. Two years later she played a wartime adulteress in The End of the Affair for which she received her first Academy Award for Best Actress nomination.In 2001, Moore portrayed the fictional character of Clarice Starling in the crime thriller sequel Hannibal, and appeared as a scientist in the science fiction comedy Evolution. The following year she re-teamed with Todd Haynes on the drama Far from Heaven and starred in the Stephen Daldry-directed drama The Hours, playing a troubled 1950s suburban housewife in both films. She garnered the Volpi Cup for Best Actress for the former and the Silver Bear for Best Actress for the latter. She also received Academy Award nominations for both Best Actress (Far From Heaven) and Best Supporting Actress (The Hours). In 2006, Moore starred in the crime drama Freedomland and Alfonso Cuarón's science fiction thriller Children of Men. She went on to play the socialite Barbara Daly Baekeland in Savage Grace (2007) and appeared opposite Colin Firth in the drama A Single Man (2009).Moore portrayed politician Sarah Palin in the 2012 political television drama Game Change, for which she won the Primetime Emmy Award for Outstanding Lead Actress in a Miniseries or a Movie. She found significant success in 2014 for starring in the satire Maps to the Stars and the drama Still Alice. For playing an ageing actress in the former she garnered the Cannes Film Festival Award for Best Actress, and her performance in the latter as a linguistics professor with early-onset Alzheimer's disease earned her the Best Actress Oscar. Moore also appeared in The Hunger Games: Mockingjay – Part 1 which earned over $755 million to emerge as her highest-grossing release. In 2017 Moore played a villainous entrepreneur in the highly successful spy film Kingsman: The Golden Circle.", "wiki_page_id": 38556498, "imdb_id": "tt1179069"}