{"text": "\n\nCabaret is a 1972 American musical drama film directed by Bob Fosse and starring Liza Minnelli, Michael York, and Joel Grey.Situated in Berlin during the Weimar Republic in 1931, under the presence of the growing Nazi Party, the film is loosely based on the 1966 Broadway musical Cabaret by Kander and Ebb, which was adapted from the novel The Berlin Stories / Goodbye to Berlin (1939) by Christopher Isherwood and the 1951 play I Am a Camera adapted from the same book. Only a few numbers from the stage score were used for the film; Kander and Ebb wrote new ones to replace those that were discarded. In the traditional manner of musical theater, called an \"integrated musical\", every significant character in the stage version sings to express his or her own emotion and to advance the plot. In the film version, the musical numbers are entirely diegetic, taking place inside the club, with one exception, \"Tomorrow Belongs to Me\", the only song sung neither by Grey's character of the Kit Kat Klub's Master of Ceremonies nor by Minnelli's character of Sally Bowles. In the sexually charged \"Two Ladies\", about a ménage à trois, the Master of Ceremonies is joined by two of the Kit Kat girls.\nAfter the box office failure of his film version of Sweet Charity in 1969, Bob Fosse bounced back with Cabaret in 1972, a year that would make him the most honored director in the movie business. The film also brought Liza Minnelli, the daughter of Judy Garland and Vincente Minnelli, her own first chance to sing on screen, and she won the Academy Award for Best Actress. With Academy Awards for Best Supporting Actor (Joel Grey), Best Cinematography, Best Art Direction, Best Sound, Best Original Song Score and Adaptation, and Best Film Editing, it holds the record for most Oscars earned by a film not honored for Best Picture. It is listed as number 367 on Empire’s 500 greatest films of all time.Cabaret opened to glowing reviews and strong box office, eventually taking in more than $20 million. In addition to its eight Oscars, it won Best Picture citations from the National Board of Review and the Hollywood Foreign Press Association and took Best Supporting Actor honors for Grey from the National Board of Review, the Hollywood Foreign Press, and the National Society of Film Critics.\n", "wiki_page_id": 236691, "imdb_id": "tt0068327"}