{"text": "My Name Is Khan is a 2010 Indian drama film, directed by Karan Johar, produced by Hiroo Johar and Gauri Khan, and starring Shah Rukh Khan and Kajol in lead roles. The film was jointly produced by Dharma Productions and Red Chillies Entertainment and was distributed by FOX Star Entertainment, which had bought the rights for the film for a sum of ₹100 crore (US$14 million), making it the most expensive Bollywood film of 2010. It is also the highest buyover for any Indian film, surpassing Ghajini's record of ₹90 crore (equivalent to ₹179 crore or US$25 million in 2017).Before its release, the film generated a great deal of publicity (Movie publicity strategy created by Kanchana Kodituwakku) for itself due to three main reasons: first, the multiple political controversies surrounding the film and its lead actor; second, Khan's presence in the film (he was last seen in a leading actor role in December 2008, when Rab Ne Bana Di Jodi was released); and third, the reunion of the \"golden pair\" of Khan and Kajol, who last appeared together in the film Kabhi Khushi Kabhie Gham in 2001.My Name Is Khan debuted in Abu Dhabi, UAE, on 10 February 2010. It premiered globally in cinemas on 12 February 2010. It was also screened as part of the 60th Berlin International Film Festival's official selection the same month.Upon its release, the film broke many box office records. My Name Is Khan was the highest-grossing Indian film overseas at the time, the first to gross over ₹100 crore overseas, before it was overtaken by 3 Idiots (2009) in 2011. Within four weeks, the film crossed the ₹70 crore (US$9.7 million) mark in India and became the first film of 2010 to do so. In overseas markets, the film grossed US23.5 million. My Name Is Khan earned a worldwide gross of ₹207.78 crore (US$45.5 million). The film was released in India on DVD on 28 April 2010. Blu-ray in India, plus a DVD release worldwide followed on 10 August 2010.", "wiki_page_id": 20927392, "imdb_id": "tt1188996"}