{"text": "\n\nFast Five (alternatively known as Fast & Furious 5 or Fast & Furious 5: Rio Heist) is a 2011 American action film directed by Justin Lin and written by Chris Morgan. It is the fifth installment in The Fast and the Furious franchise. It was released first in Australia on April 20, 2011, and then in the United States on April 29, 2011. Fast Five follows Dominic Toretto (Vin Diesel), Brian O'Conner (Paul Walker), and Mia Toretto (Jordana Brewster) as they plan a heist to steal $100 million from corrupt businessman Hernan Reyes (Joaquim de Almeida) while being pursued for arrest by U.S. Diplomatic Security Service (DSS) agent Luke Hobbs (Dwayne Johnson).\nWhile developing Fast Five, Universal Studios deliberately departed from the street racing theme prevalent in previous films in the series, to transform the franchise into a heist action series involving cars. By doing so, they hoped to attract wider audiences that might otherwise be put off by a heavy emphasis on cars and car culture. Fast Five is considered the transitional film in the series, featuring only one car race and giving more attention to action set pieces such as gun fights, brawls, and the heist of $100 million. The production mounted a comprehensive marketing campaign, marketing the film through social media, virtual games, cinema chains, automobile manufacturers, and at NASCAR races.\nFast Five achieved financial success, breaking box office records for the highest-grossing April opening weekend and the second-highest spring opening weekend, and surpassing Fast & Furious (2009) to become the highest-grossing film in the franchise. Fast Five grossed over $625 million worldwide, making it number 66 on the all-time worldwide list of highest-grossing films, in unadjusted dollars, and the seventh-highest-grossing film of 2011.\nFast Five received mostly positive reviews, with critics praising the combination of comedy and \"action sequences that toy idly with the laws of physics\"; some labeled it the best film in the series. Johnson was singled out for praise in numerous reviews for his performance, with critics calling him \"the best thing, by far, in Fast Five\" and remarking that scenes shared by Johnson and Diesel were often the \"best moments\". Despite the positive response, many were critical of the film's running time, considering it too long, and others criticized the treatment of women, stating \"[Women] cameo strikingly in buttock form. Others actually have first names.\" South American reviewers were critical of the film's portrayal of Rio de Janeiro as a haven for drug trafficking and corruption, labeling it a \"stereotype\". A sequel, Fast & Furious 6, was released in May 2013 to box office success, surpassing Fast Five as the highest-grossing film in the franchise. Another sequel, Furious 7, released in April 2015, soon surpassed Fast & Furious 6, grossing over $1.5 billion worldwide.\n\n", "wiki_page_id": 28085067, "imdb_id": "tt1596343"}