{"text": "\n\nFrozen is a 2013 American 3D computer-animated musical fantasy film produced by Walt Disney Animation Studios and released by Walt Disney Pictures. The 53rd Disney animated feature film, it is inspired by Hans Christian Andersen's fairy tale \"The Snow Queen\". It tells the story of a fearless princess who sets off on a journey alongside a rugged iceman, his loyal reindeer, and a naïve snowman to find her estranged sister, whose icy powers have inadvertently trapped their kingdom in eternal winter.\nFrozen underwent several story treatments before being commissioned in 2011, with a screenplay written by Jennifer Lee, who also co-directed with Chris Buck. The film features the voices of Kristen Bell, Idina Menzel, Jonathan Groff, Josh Gad, and Santino Fontana. Christophe Beck was hired to compose the film's orchestral score, while Robert Lopez and Kristen Anderson-Lopez wrote the songs.\nFrozen premiered at the El Capitan Theatre in Hollywood, California, on November 19, 2013, had a limited release on November 22 and went into general theatrical release on November 27. It was met with positive reviews and praise for its visuals, screenplay, themes, music, and voice acting; some film critics consider Frozen to be the best Disney animated feature film since the studio's renaissance era. The film also achieved significant commercial success, earning $1.276 billion in worldwide box office revenue, including $400 million in the United States and Canada and $247 million in Japan. It ranks as the highest-grossing animated film of all time, the 13th highest-grossing film of all time, the highest-grossing film of 2013, and the third highest-grossing film in Japan. It was also the highest-earning film with a female director in terms of US earnings, until surpassed by Warner Bros.' Wonder Woman. With over 18 million home media sales in 2014, it became the best-selling film of the year in the United States. By January 2015, Frozen had become the all-time best-selling Blu-ray Disc in the United States.Frozen won two Academy Awards for Best Animated Feature and Best Original Song (\"Let It Go\"), the Golden Globe Award for Best Animated Feature Film, the BAFTA Award for Best Animated Film, five Annie Awards (including Best Animated Feature), two Grammy Awards for Best Compilation Soundtrack for Visual Media and Best Song Written for Visual Media (\"Let It Go\"), and two Critics' Choice Movie Awards for Best Animated Feature and Best Original Song (\"Let It Go\"). An animated short sequel, Frozen Fever, premiered on March 13, 2015, and a feature-length sequel is set for release on November 27, 2019.", "wiki_page_id": 34164547, "imdb_id": "tt2294629"}