{"text": "The Iron Giant is a 1999 American animated science fiction film using both traditional animation and computer animation, produced by Warner Bros. Feature Animation and directed by Brad Bird in his directorial debut. It is based on the 1968 novel The Iron Man by Ted Hughes (which was published in the United States as The Iron Giant) and was scripted by Tim McCanlies from a story treatment by Bird. The film stars the voices of Eli Marienthal, Christopher McDonald, Jennifer Aniston, Harry Connick, Jr., John Mahoney, and Vin Diesel. Set during the Cold War in 1957, the film is about a young boy named Hogarth Hughes, who discovers and befriends a giant robot who fell from space. With the help of beatnik artist Dean McCoppin, they attempt to prevent the U.S. military and Kent Mansley, a paranoid federal agent, from finding and destroying the Giant.\nThe film's development phase began in 1994 as a musical with the involvement of The Who's Pete Townshend, though the project took root once Bird signed on as director and hired McCanlies to write the screenplay in 1996. The film was created traditionally, with computer-generated imagery used to animate the title character and other effects. The understaffed crew of the film completed it with half of the time and budget of other animated features. Michael Kamen composed the film's score, which was performed by the Czech Philharmonic.\nThe Iron Giant premiered at Mann's Chinese Theater in Los Angeles on July 31, 1999, and was released worldwide on August 6. Upon its release, the film significantly under-performed at the box office, making $31.3 million worldwide against a budget of $70–80 million, which was blamed on an unusually poor marketing campaign. However, the film received widespread critical acclaim with praise directed at the story, animation, characters, the portrayal of the title character, and the voice performances of Aniston, Connick, Jr., Diesel, McDonald, Mahoney, and Marienthal. The film was nominated for several awards, winning nine Annie Awards out of 15 nominations. Through home video releases and television syndication, the film gathered a cult following and is now widely regarded as a modern animated classic. In 2015, an extended, remastered version of the film was re-released theatrically, which saw a home video release the following year.\n", "wiki_page_id": 842825, "imdb_id": "tt0129167"}