{"text": "Zucker, Abrahams and Zucker (abbreviated ZAZ) was an American comedy filmmaking trio consisting of Jim Abrahams and brothers David Zucker and Jerry Zucker who specialized in writing slapstick comedy films during the 1980s. The trio knew each other during their childhood years, growing up in Shorewood, Wisconsin, and attended Shorewood High School, which is sometimes referenced in their work. While attending the University of Wisconsin–Madison, the trio formed a theater group called \"Kentucky Fried Theater\", which led to their sketch comedy film, The Kentucky Fried Movie.\nThis was followed in 1980 by the trio's breakout hit, Airplane!, which remains a revered comedic milestone. Subsequent collaborations include the TV series Police Squad!, its subsequent Naked Gun movie trilogy, and the films Top Secret! and Ruthless People. All of their projects relied heavily on parodies, visual gags and breaking of the fourth wall, and established a strong cult following. The notable stylistic exception is Ruthless People, a more traditional farce that was directed by the trio, but unlike their other productions, not written by them.\nProminent ZAZ players include Leslie Nielsen, Lloyd Bridges, Robert Stack, Rowan Atkinson, Whoopi Goldberg, and Charlie Sheen. The trio's status as a three-person team of co-directors is highly unusual, although some of their later projects were directed by David Zucker working solo, and with Jerry Zucker and Abrahams credited only as producers and/or writers. Each member of the group has also had individual careers:\n\nDavid Zucker directed BASEketball, My Boss's Daughter, and Scary Movie 3 and 4.\nAbrahams directed Hot Shots! and Jane Austen's Mafia!.\nJerry Zucker directed Ghost, First Knight, and Rat Race. Of the three, Jerry Zucker has found the most mainstream non-comedic success including Ghost and First Knight, which grossed $505 million and $127 million worldwide respectively.", "wiki_page_id": 1575820, "imdb_id": "tt0099653"}