{"text": "\n\n\nDon, also known as Don: The Chase Begins Again, is a 2006 Indian action-thriller film directed by Farhan Akhtar. The film was produced by Ritesh Sidhwani and Akhtar's production company Excel Entertainment. The film stars Shah Rukh Khan and Priyanka Chopra, with Arjun Rampal, Boman Irani, Isha Koppikar, and Om Puri appearing in supporting roles. Don is a reboot of the 1978 film of the same name, and follows the titular criminal's look-alike who has been sent on a clandestine mission to impersonate Don after he is wounded in a chase, and to infiltrate the plans of the drug mafia.\nIn remaking the film from a new perspective, Farhan Akhtar wanted to give a contemporary style and treatment to the original film and make a film that he believed would be perfectly suited to modern times. The director later bought the rights and conceived his adaptation as an homage to the original film and its cast and crew, and to the 1970s era in general. He co-wrote the screenplay with his father, Javed Akhtar, who had also written the original script with Salim Khan. He kept the basic plot but introduced some changes that included an international setting and a different ending. Principal photography commenced in Mumbai, before moving to Malaysia, where 80% of the filming was done. The soundtrack was composed by Shankar-Ehsaan-Loy, with lyrics by Javed Akhtar.\nThe film was released on 20 October 2006, coinciding with the Diwali festive season. The film was generally well received by film critics, with praise directed towards Chopra's performance, action sequences, music, production design and cinematography. A major commercial success, Don grossed over ₹1.06 billion at the box office against a budget of ₹380 million and was the fifth highest-grossing Indian film of 2006. \nDon was awarded Best Asian Film at the Neuchâtel International Fantastic Film Festival. The film was also nominated for nine awards at the 52nd Filmfare Awards, including nominations for Best Film and Best Actor for sharukh Khan. A sequel entitled Don 2 was released on 23 December 2011.\n", "wiki_page_id": 3607757, "imdb_id": "tt0461936"}