{"text": "Tron is a 1982 American science fiction action-adventure film written and directed by Steven Lisberger from a story by Lisberger and Bonnie MacBird. The film stars Jeff Bridges as a computer programmer who is transported inside the software world of a mainframe computer where he interacts with programs in his attempt to escape. Bruce Boxleitner, David Warner, Cindy Morgan, and Barnard Hughes star in supporting roles.\nDevelopment of Tron began in 1976 when Lisberger became intrigued with the early video game Pong. He and producer Donald Kushner set up an animation studio to develop Tron with the intention of making it an animated film.  Indeed, to promote the studio itself, Lisberger and his team created a 30-second animation featuring the first appearance of the eponymous character.  Eventually, Lisberger decided to include live-action elements with both backlit and computer animation for the actual feature-length film.  Various film studios had rejected the storyboards for the film before Walt Disney Productions agreed to finance and distribute Tron.  There, backlit animation was finally combined with the computer animation and live action.\nTron was released on July 9, 1982 in 1,091 theaters in the United States. The film was a moderate success at the box office, and received positive reviews from critics who praised the groundbreaking visuals and acting. However, the storyline was criticized at the time for being incoherent. Tron received nominations for Best Costume Design and Best Sound at the 55th Academy Awards, and received the Academy Award for Technical Achievement fourteen years later. Over time, Tron developed into a cult film and eventually spawned a franchise, which consists of multiple video games, comic books and an animated television series. A sequel titled Tron: Legacy directed by Joseph Kosinski was released on December 17, 2010, with Bridges and Boxleitner reprising their roles, and Lisberger acting as producer, followed by the animated series Tron: Uprising set between the two films.\n", "wiki_page_id": 312757, "imdb_id": "tt0084827"}