{"text": "Audition (オーディション, Ōdishon) is a 1999 Japanese horror film based on the novel of the same name, directed by Takashi Miike. It is about a recent widower, Shigeharu Aoyama (Ryo Ishibashi), whose son suggests that he find a new wife. Aoyama agrees, and with a friend, stages a phony audition to meet a potential new partner in life. After interviewing several women, Aoyama becomes interested in Asami (Eihi Shiina), who responds well to him, although as they begin to date, her dark past begins to affect their relationship.\nAudition was originally started by the Japanese company Omega Project, who wanted to make a horror film after the great financial success of their previous production Ring. To create the film, the company purchased the rights to Ryu Murakami's book Audition, and hired screenwriter Daisuke Tengan and director Miike to film an adaptation. The cast and crew consisted primarily of people Miike had worked with on previous projects, with the exception of Shiina, who had worked as a model prior to beginning a career in film. The film was shot in about three weeks in Tokyo.\nThe film premiered, with a few other Japanese horror films, at the Vancouver International Film Festival, but it began to receive much more attention when it was shown at the Rotterdam International Film Festival in 2000, where it received the FIPRESCI Prize and the KNF Award. Following a theatrical release in Japan, the film continued to play at festivals and had theatrical releases in the United States and United Kingdom, followed by several home media releases. Audition was received positively by Western film critics on its release, with many noting the final torture sequence in the film and how it contrasts with the non-horrific scenes before. The film has appeared on several lists of the best horror films ever made, and has had an influence on other horror films and directors including Eli Roth and the Soska sisters.\n", "wiki_page_id": 587265, "imdb_id": "tt0235198"}