{"text": "\n\nLone Survivor is a 2013 American biographical war drama film based on the eponymous 2007 non-fiction book by Marcus Luttrell with Patrick Robinson. Set during the war in Afghanistan, it dramatizes the unsuccessful United States Navy SEALs counter-insurgent mission Operation Red Wings, during which a four-man SEAL reconnaissance and surveillance team was tasked to track down the Taliban leader Ahmad Shah. Written and directed by Peter Berg, the film stars Mark Wahlberg, Taylor Kitsch, Emile Hirsch, Ben Foster, and Eric Bana.\nUpon first learning of the book in 2007, Berg arranged several meetings with Luttrell to discuss adapting the book to film. Universal Pictures acquired the film rights in August 2007, after bidding against other major studios. In re-enacting events, Berg drew much of his screenplay from Luttrell's eyewitness accounts in the book, as well as autopsy and incident reports related to the mission. After directing Battleship (2012) for Universal, Berg resumed working on Lone Survivor. Principal photography began in October 2012 and concluded in November, after 42 days. Filming took place on location in New Mexico, using digital cinematography. Luttrell and several other Navy SEAL veterans acted as technical advisors, while multiple branches of the United States Armed Forces aided the production. Two companies, Industrial Light & Magic and Image Engine, were responsible for the visual effects.\nLone Survivor opened in limited release in the United States on December 25, 2013, before opening across North America on January 10, 2014. It received generally positive reviews; some critics praised Berg's direction, as well as the acting, story, visuals and battle sequences, while others derided the film for focusing more on its action scenes than on characterization. Lone Survivor grossed over $154 million, of which $125 million was from North America. It was chosen by National Board of Review as one of the top ten films of 2013, and received two Academy Award nominations for Best Sound Editing and Best Sound Mixing.\n", "wiki_page_id": 38927316, "imdb_id": "tt1091191"}