{"text": "\n\nDallas Buyers Club is a 2013 American biographical drama film, co-written by Craig Borten and Melisa Wallack, and directed by Jean-Marc Vallée. The film tells the story of Ron Woodroof, an AIDS patient diagnosed in the mid 1980s when HIV/AIDS treatments were under-researched, while the disease was not understood and highly stigmatized. As part of the experimental AIDS treatment movement, he smuggled unapproved pharmaceutical drugs into Texas for treating his symptoms, and distributed them to fellow people with AIDS by establishing the \"Dallas Buyers Club\" while facing opposition from the Food and Drug Administration (FDA). Two fictional supporting characters, Dr. Eve Saks (Jennifer Garner), and Rayon (Jared Leto), were composite roles created from the writers' interviews with transgender AIDS patients, activists, and doctors. Presidential biographer and PEN-USA winner Bill Minutaglio wrote the first magazine profile of The Dallas Buyers Club in 1992. The article, which featured interviews with Woodroof and also recreated his dramatic international exploits, attracted widespread attention from filmmakers and journalists.Screenwriter Borten interviewed Woodroof in 1992 and wrote the script, which he polished with writer Wallack in 2000, and then sold to producer Robbie Brenner. Several other actors, directors, and producers who were attached at various times to the development of the film left the project. Universal Pictures also tried to make the film, but did not. A couple of screenwriters wrote drafts that were rejected. In 2009, producer Brenner involved Matthew McConaughey, because of his Texas origins, the same as Woodroof's. Brenner selected the first draft, written by Borten and Wallack, for the film, and then Vallée was set to direct the film. Principal photography began on November 11, 2012, in New Orleans, Louisiana, continuing for 25 days of filming, which also included shooting in Baton Rouge. Brenner and Rachel Winter co-produced the film. The official soundtrack album featured various artists, and was released digitally on October 29, 2013, by the Relativity Music Group.\nDallas Buyers Club premiered at the 2013 Toronto International Film Festival and was released theatrically in the United States on November 1, 2013, by Focus Features, entering wide release on November 22. The film grossed over $27 million domestically and $27.9 million internationally, against a budget of $5 million in 182 days of a theatrical run. It grossed over $4.5 million from DVD sales, and over $3 million from Blu-ray sales. The film received universal critical acclaim, resulting in numerous accolades. Most praised the performances of McConaughey and Leto, who received the Academy Award for Best Actor and for Best Supporting Actor, respectively, at the 86th Academy Awards, making this the first film since Mystic River (2003), and only the fifth movie ever, to win both awards. The film also won the award for Best Makeup and Hairstyling, and garnered nominations for Best Picture, Best Original Screenplay, and Best Editing.\n\n", "wiki_page_id": 37617614, "imdb_id": "tt0790636"}