{"text": "\n\nThe Adventures of Tintin, known as The Adventures of Tintin: The Secret of the Unicorn outside North America, is a 2011 3D motion capture computer-animated mystery adventure film based on The Adventures of Tintin, the comics series by Belgian cartoonist Hergé. Directed by Steven Spielberg, produced by Peter Jackson, and written by Steven Moffat, Edgar Wright, and Joe Cornish, the film is based on three of Hergé's albums: The Crab with the Golden Claws (1941), The Secret of the Unicorn (1943), and Red Rackham's Treasure (1944). The cast includes Jamie Bell, Andy Serkis, Daniel Craig, Nick Frost, and Simon Pegg.\nSpielberg acquired rights to produce a film based on The Adventures of Tintin series following Hergé's death in 1983, and re-optioned them in 2002. Filming was due to begin in October 2008 for a 2010 release, but release was delayed to 2011 after Universal opted out of producing the film with Paramount, who provided $30 million on pre-production. Sony chose to co-produce the film. The delay resulted in Thomas Sangster, who had been originally cast as Tintin, departing from the project. Producer Peter Jackson, whose company Weta Digital provided the computer animation, intends to direct a sequel. Spielberg and Jackson also hope to co-direct a third film. The world première took place on 22 October 2011 in Brussels. The film was released in the United Kingdom and other European countries on 26 October 2011, and in the United States on 21 December 2011, in Digital 3D and IMAX.The Adventures of Tintin grossed over $373 million, and received positive reviews from critics, being compared to Spielberg's previous work Raiders of the Lost Ark. It was the first non-Pixar animated film to win the Golden Globe Award for Best Animated Feature Film. Williams was nominated for an Academy Award for Best Original Score. It was nominated for six Saturn Awards, including Best Animated Film, Best Director for Spielberg and Best Music for Williams.", "wiki_page_id": 11400848, "imdb_id": "tt0983193"}