{"text": "\n\nSaving Private Ryan is a 1998 American epic war film directed by Steven Spielberg and written by Robert Rodat. Set during the Invasion of Normandy in World War II, the film is notable for its graphic portrayal of war, and for the intensity of its opening 27 minutes, which includes a depiction of the Omaha Beach assault during the Normandy landings. It follows United States Army Rangers Captain John H. Miller (Tom Hanks) and a squad (Tom Sizemore, Edward Burns, Barry Pepper, Giovanni Ribisi, Vin Diesel, Adam Goldberg, and Jeremy Davies) as they search for a paratrooper, Private First Class James Francis Ryan (Matt Damon), who is the last-surviving brother of four servicemen.\nRodat wrote the script in 1994 and was eventually picked up by Paramount Pictures in 1996. Spielberg, who at the time was forming DreamWorks Pictures, came on board to direct the project and both DreamWorks and Paramount jointly produce and release the film. After the cast went through training supervised by Marine veteran Dale Dye, the film's principal photography started in June 1997 and lasted two months. The film's D-Day scenes were shot in Ballinesker Beach, Curracloe Strand, Ballinesker, just east of Curracloe, County Wexford, Ireland.\nThe film received universal acclaim from critics and audiences; praise was given to Spielberg's directing, the performances (particularly from Hanks), the battle sequences, cinematography, score, and screenplay. It was also a commercial success, grossing $216.8 million domestically, making it the highest-grossing film of 1998 in the United States, and $481.8 million worldwide, making it the second-highest-grossing film of 1998 worldwide. The film was nominated for 11 Academy Awards, including Best Picture, and won five, including  Spielberg's second win for Best Director, Best Film Editing, Best Cinematography, Best Sound Mixing and Best Sound Editing. Saving Private Ryan was released on home video in May 1999, earning another $44 million from sales. \nSince its release, the film has been frequently lauded as a groundbreaking film in the war genre and has been hailed as one of the best films ever made. In 2014, the film was selected for preservation in the National Film Registry by the Library of Congress, being deemed \"culturally, historically, or aesthetically significant.\"", "wiki_page_id": 28269, "imdb_id": "tt0120815"}