{"text": "The Austin Powers series is a series of American spy action comedy films: Austin Powers: International Man of Mystery (1997), Austin Powers: The Spy Who Shagged Me (1999) and Austin Powers in Goldmember (2002). The films were directed by Jay Roach; produced, written by and starring Mike Myers as both the title character and Dr. Evil; and distributed by New Line Cinema.\nThe franchise parodies numerous films and characters, including James Bond, Derek Flint, Matt Helm and Jason King, and incorporates myriad other elements of popular culture as it follows a British spy's quest to bring his nemesis down. The character represents an archetype of 1960s Swinging London, with his advocacy of free love, his use of obscure impressions and his clothing style.\nThe films poke fun at the outrageous plots, rampant sexual innuendo, and two-dimensional stock characters characteristically associated with 1960s spy films, as well as the cliché of the ultra-suave super spy. Contrary to the handsome, super-smooth leading men of the James Bond genre, Austin Powers is not conventionally attractive (he is especially known for his bad teeth), although female characters in the films seem to find him irresistible.\nThe general theme of the films is that the arch villain Dr. Evil plots to extort large sums of money from governments or international bodies but is constantly thwarted by Powers, and (to a degree) his own inexperience with life and culture in the 1990s.\nIn Austin Powers: International Man of Mystery, Austin and Dr. Evil are awakened after being cryogenically frozen for thirty years. \nContinuing to incorporate cultural elements of the 1960s and 1970s, Austin Powers: The Spy Who Shagged Me and Austin Powers in Goldmember feature time travel as a plot device and deliberately overlook inconsistencies. A proposed fourth film, Austin Powers 4, has reportedly been in development since 2005, but has yet to be produced as of 2018. \n", "wiki_page_id": 7654698, "imdb_id": "tt0295178"}