{"text": "Evil Dead is an American horror film franchise created by Sam Raimi consisting of four feature films and a television series.  The series revolves around the Necronomicon Ex-Mortis, an ancient Sumerian text which wreaks havoc upon a group of cabin inhabitants in a wooded area in Tennessee (later confirmed to be Elk Rapids in Michigan).\nThe protagonist, Ashley Joanna \"Ash\" Williams (Bruce Campbell) is the only character to appear in every installment of the original trilogy, with the exception of his main love interest Linda, who appears in Army of Darkness during only the prologue. The original trilogy includes The Evil Dead (1981), Evil Dead II (1987), and Army of Darkness (1992), all written and directed by Raimi, produced by Robert G. Tapert, and starring Campbell. The franchise has since expanded into other formats, including video games, comic books, a musical, and a television series.\nThe franchise was resurrected in 2013 with Evil Dead, both a reboot and a loose continuation of the series directed by Fede Álvarez and produced by Raimi, Campbell and Tapert. Before the television series, Ash vs Evil Dead, was announced, at least three other installments of the franchise were in development: a sequel to the 2013 reboot titled Evil Dead 2, a direct sequel to Army of Darkness starring Campbell and directed by Sam Raimi, and finally a seventh film which would merge the narratives of both film series.In July 2014, Bruce Campbell stated it was likely that the planned sequel would instead be a TV series with him as the star. On November 10, 2014, Starz announced that a ten-episode series titled Ash vs Evil Dead would premiere on their cable network in 2015. The series was renewed for an additional twenty episodes and starred Bruce Campbell as Ash and was executive produced by Campbell, Sam Raimi, and Rob Tapert. Since the show was announced to the public, there has been no news of further films in the franchise.\n", "wiki_page_id": 5574010, "imdb_id": "tt0083907"}