{"text": "\n\nThe X-Files (also known as The X-Files: Fight the Future) is a 1998 American science fiction thriller film directed by Rob Bowman. Chris Carter wrote the screenplay. The story is by Carter and Frank Spotnitz. It is the first feature film based on Carter's television series The X-Files,  which revolves around fictional unsolved cases called the X-Files and the characters solving them. Five main characters from the television series appear in the film: David Duchovny, Gillian Anderson, Mitch Pileggi, John Neville, and William B. Davis reprise their respective roles as FBI agents Fox Mulder and Dana Scully, FBI Assistant Director Walter Skinner, Well-Manicured Man, and the Cigarette-Smoking Man. The film was promoted with the tagline Fight the Future.\nThe film takes place between seasons five (episode \"The End\") and six (episode \"The Beginning\") of the television series, and is based upon the series' extraterrestrial mythology. The story follows agents Mulder and Scully, removed from their usual jobs on the X-Files, and investigating the bombing of a building and the destruction of criminal evidence. They uncover what appears to be a government conspiracy attempting to hide the truth about an alien colonization of Earth.\nCarter decided to make a feature film to explore the show's mythology on a wider scale, as well as appealing to non-fans. He wrote the story with Frank Spotnitz at the end of 1996 and, with a budget from 20th Century Fox, filming began in 1997, following the end of the show's fourth season. Carter assembled cast and crew from the show, as well as some other, well-known actors such as Blythe Danner and Martin Landau, to begin production on what they termed \"Project Blackwood\".  The film was produced by Carter and Daniel Sackheim. Mark Snow continued his role as X-Files composer to create the film's score.\nThe film premiered on June 19, 1998, in the United States, and received mixed to positive reviews from critics. Although some enjoyed the style and effects of the film, others found the plot confusing and viewed it as little more than an extended episode of the series. A sequel, titled I Want to Believe, was released ten years later.\n", "wiki_page_id": 1078863, "imdb_id": "tt0120902"}