{"text": "\n\nResident Evil: Afterlife is a 2010 3D action horror film written and directed by Paul W. S. Anderson. It stars Milla Jovovich, Ali Larter, Kim Coates, Shawn Roberts, Spencer Locke, Boris Kodjoe, and Wentworth Miller. The film marks Anderson's second time to direct in the series, the first being the first installment. It is the first to be shot in 3D and fourth installment in the Resident Evil film series, which is based on the Capcom survival horror video game series of the same name.\nThe film follows Alice searching for and rescuing the remaining survivors in Los Angeles after the T-virus outbreak, and teaming up against Albert Wesker, the head of the Umbrella Corporation. Chris Redfield, a primary character from the video games, was featured for the first time in the film franchise. Other characters from the games and films who returned are: Claire Redfield, Chris's sister who has lost her memory prior to the film's events; Albert Wesker, the film's main antagonist; and Jill Valentine, who made a cameo appearance.\nIn May 2005, producers mentioned the possibility of following Extinction with a sequel titled Afterlife. Extinction was released in 2007 and was a box office success, prompting Afterlife to begin development in June 2008, with the script being written by Anderson that December. Elements from the video game Resident Evil 5 (2009) were incorporated into the film. Filming took place in Toronto from September to December 2009 using the 3D Fusion Camera System.\nThe film was released in 3D and IMAX 3D theaters on September 10, 2010, to generally negative reviews. The film grossed $60 million in the United States and Canada on an estimated $60 million budget, and made $240 million in other markets surpassing the previous film's overseas total in the second week of release. Grossing a worldwide total of $300 million, Resident Evil: Afterlife became the second highest-grossing entry of the series. Resident Evil: Afterlife was released to DVD, Blu-ray, and Blu-ray 3D on December 28, 2010 in the United States.\n", "wiki_page_id": 15332396, "imdb_id": "tt1220634"}