{"text": "Spring Breakers is a 2012 American crime film written and directed by Harmony Korine. It stars James Franco, Vanessa Hudgens, Selena Gomez, Ashley Benson and Rachel Korine and follows four college-aged girls on their spring break in Florida where they meet an eccentric local drug dealer named Alien who helps them in a time of desperation, and their eventual descent into a world of drugs, crime, and violence.Korine had devised the concept for Spring Breakers over several years prior to production, with fleeting ideas about the plot and what should transpire. His initial desire was to create a \"sensory film\" that was more about feeling than action and placed little importance on narrative or plot, the idea for which came later. Once Korine developed the backbone of the story, which takes place around the American spring break period, he travelled to Florida to write the screenplay. Production began in 2012, on an estimated budget of $5 million–a relatively small amount in today's film industry, albeit Korine's second most expensive film to date. The film is also one of Korine's first theatrical works to receive a wide release.Spring Breakers was released on March 22, 2013 in the United States by A24 and grossed $31 million worldwide, making it a resounding success considering the small budget. It received generally positive reviews from film critics, with some calling it a potential cult classic. The film was selected to compete for the Golden Lion at the 69th Venice International Film Festival. Critics and scholars have read deeper meaning in the film's plot, commenting on its reflection of modern-day superficiality and the younger generation's obsession with highly stylised, disposable pop culture media and sensory ephemera. It ranks in BBC's 100 Greatest Films of the 21st Century. A sequel, under the name of Spring Breakers: The Second Coming, was announced for an undated release. Jonas Åkerlund was confirmed to direct with Irvine Welsh penning the script, without the involvement of Korine or the original cast.", "wiki_page_id": 34004505, "imdb_id": "tt2101441"}