{"text": "\n\nFriday the 13th: A New Beginning (also known as Friday the 13th Part V)  is a 1985 American slasher film directed by Danny Steinmann, and starring Melanie Kinnaman, John Shepherd, and Shavar Ross. It is the fifth installment in the Friday the 13th film series, after The Final Chapter (1984). Narratively, A New Beginning departs from the Camp Crystal Lake setting and Jason Voorhees-themed mystery of the previous four installments and instead acts as a psychological horror film set at a fictional halfway house, where an adult Tommy Jarvis—who, as a child killed Voorhees—begins to fear again as a new series of brutal murders have been occurring by a new hockey-masked assailant. The film features a cameo appearance from Corey Feldman, who portrayed Tommy in the previous film.The frequency of graphic violence and blood is expedited in A New Beginning, with the film featuring a high number of on-screen murders. Aside from its gore, the film has also become known for its explicit nudity and sex scene, as well as frequent drug use. Peter Bracke's book Crystal Lake Memories: The Complete History of Friday the 13th details that behind the scenes, the production was plagued with hardcore drug use.\nShot in California in 1984 on a budget of $2.2 million, A New Beginning was released theatrically in March 1985, and grossed $21 million at the U.S. box office, making it the second poorest performing film in the Friday the 13th series at the time with a steep decline from the previous two entries.  The film was initially going to set up a new trilogy of films with a different villain for the series. However, after A New Beginning's disappointing reception from fans and steep decline in box-office receipts from The Final Chapter, Jason Voorhees was brought back for Friday the 13th Part VI: Jason Lives and has been the main antagonist in every entry in the series since. In addition to weak box office returns, most critics gave the film negative reviews. In later years, much like the series in general, the film has obtained a cult following.", "wiki_page_id": 2328364, "imdb_id": "tt0089173"}