{"text": "\n\nMel Gibson, AO, is an American actor director producer and filmmaker who made his acting debut on the Australian television drama series The Sullivans (1976–1983). While a student at the National Institute of Dramatic Art in Sydney, he was given an uncredited role in I Never Promised You a Rose Garden and subsequently appeared as a leading actor in the micro budget surf drama Summer City (both in 1977). Gibson rose to prominence during the Australian New Wave cinema movement in the early 1980s, having appeared in his breakthrough role in George Miller's dystopian action film Mad Max (1979), portraying the eponymous hero. He reprised the role in its sequels, Mad Max 2 (1981) and Mad Max Beyond Thunderdome (1985). He appeared in Peter Weir's war drama Gallipoli (1981) and the romantic drama The Year of Living Dangerously (1982). Five years later he played Martin Riggs in the buddy cop action comedy Lethal Weapon alongside Danny Glover—a role he later reprised in its sequels Lethal Weapon 2 (1989), Lethal Weapon 3 (1992), and Lethal Weapon 4 (1998).Gibson starred in Franco Zeffirelli's Hamlet in 1990, as the eponymous character of the Shakespearean tragedy of the same name. It was the first film produced by Icon Productions, a production company he co-founded with Bruce Davey. Gibson's directorial debut was The Man Without a Face (1993), an adaptation of Isabelle Holland's novel of the same name. Two years later he directed and produced Braveheart, a historical epic drama in which he also portrayed Sir William Wallace, a 13th-century Scottish knight. The film earned him a Golden Globe Award and the Academy Award for Best Director, and the film won an Academy Award for Best Picture. Gibson went on to star in Ransom (1996), Payback (1999), What Women Want and The Patriot (both in 2000), and We Were Soldiers (2002).Gibson co-wrote, directed and produced The Passion of the Christ in 2004, a Biblical epic drama which chronicled the Passion of Jesus. On its release, the film garnered mixed reviews as well as notoriety for its graphic violence and alleged anti-Semitic undertones from critics. Nevertheless, it grossed $370.3 million in the United States and $611.4 million worldwide, making it Gibson's highest-grossing film to date. Two years later he co-wrote, directed and produced Apocalypto, an epic adventure set in Central America depicting the last days of Mayan civilization before Spanish arrival in the 16th century. Gibson then took a ten-year hiatus from directing during which time he landed roles in Edge of Darkness (2010), Machete Kills (2013), The Expendables 3 (2014), and Blood Father (2016). He directed Hacksaw Ridge in 2016, a biographical war drama focusing on American World War II veteran Desmond Doss, the first conscientious objector to receive the Medal of Honor. The film garnered praise from critics and audiences alike, as well as various accolades.\n", "wiki_page_id": 28109451, "imdb_id": "tt0107501"}