{"text": "\n\nSpider-Man is a 2002 American superhero film directed by Sam Raimi, based on the Marvel Comics character of the same name and the first installment in the Spider-Man trilogy. The film stars Tobey Maguire as Peter Parker, a high school student living in New York City, who lives a double life as a vigilante: Spider-Man, after developing spider-like super powers. Spider-Man also stars Kirsten Dunst as Peter's love interest Mary Jane Watson, Willem Dafoe as Norman Osborn, the secret identity of his foe Green Goblin, Rosemary Harris and Cliff Robertson as Aunt May and Uncle Ben, James Franco as Peter's best friend Harry Osborn, and J. K. Simmons as J. Jonah Jameson, the editor-in-chief and publisher of the Daily Bugle.\nAfter progress on the film stalled for nearly 25 years, it was licensed for a worldwide release by Columbia Pictures in 1999 after it acquired options from MGM on all previous scripts developed by Cannon Films, Carolco and New Cannon. Exercising its option on just two elements from the multi-script acquisition (a different screenplay was written by James Cameron, Ted Newsom, John Brancato, Barney Cohen and Joseph Goldman), Sony hired David Koepp to create a working screenplay (credited as Cameron's), and Koepp received sole credit in final billing. Directors Roland Emmerich, Ang Lee, Chris Columbus, Jan de Bont, M. Night Shyamalan, Tony Scott and David Fincher were considered to direct the project before Raimi was hired as director in 2000. The Koepp script was rewritten by Scott Rosenberg during pre-production and received a dialogue polish from Alvin Sargent during production. Filming took place in Los Angeles and New York City from January 8 to June 30, 2001.\nSpider-Man premiered in the Philippines on April 30, 2002 and had its general release in the United States on May 3, 2002. It became a critical and financial success: it was the first film to reach $100 million in a single weekend, and became the most successful film based on a comic book. With a box office gross of $821.7 million worldwide, it was 2002's third-highest-grossing film and became the seventh-highest-grossing film of all time. The film went on to gross a total revenue of $1.5 billion from box office and home video sales. The film competed at the 75th Academy Awards ceremony for Best Visual Effects and Best Sound. The film is credited for redefining the modern superhero genre, as well as the summer blockbuster, and due to its success it was followed by two sequels, Spider-Man 2 (2004) and Spider-Man 3 (2007).\n", "wiki_page_id": 146947, "imdb_id": "tt0145487"}