{"text": "\n\nVeer-Zaara (Hindi pronunciation: [ʋiːr zaːraː]) is a 2004 Indian romantic drama film directed  and co-produced by Yash Chopra with his son Aditya Chopra. It stars Shah Rukh Khan and Preity Zinta as the eponymous star-crossed lovers; Veer is an Indian Air Force pilot and Zaara is a Pakistani woman hailing from a rich political family of Lahore. When Veer learns Zaara loves him, he quits his job to go to Pakistan, where he is imprisoned on false charges. Years later, a young Pakistani lawyer played by Rani Mukerji finds Veer in prison and upon listening to his story, tries to free him. Veer-Zaara had Divya Dutta, Manoj Bajpayee, Akhilendra Mishra and Anupam Kher play supporting roles, with a special appearance from Amitabh Bachchan and Hema Malini.\nChopra wanted to make his return to cinema after seven years; he was dissatisfied with the scripts he received. Aditya then narrated a few scenes of a story he had written, which interested Chopra and prompted him to direct it. Chopra intended the film to be a tribute to Punjab; it was to be titled Yeh Kahan Aa Gaye Hai Hum. Set in India and Pakistan, principal photography took place in Punjab and various locations in Mumbai; parts of the film were also shot in Pakistan. The soundtrack album, based on old compositions by Madan Mohan with lyrics by Javed Akhtar, was the highest-selling album of the year in India.\nThe film was released on 12 November 2004 during the Diwali festival, Veer-Zaara earned over ₹976.4 million worldwide, becoming the highest-grossing Indian film of the year in both India and overseas territories. It received positive reviews from critics, with praise directed to the story, dialogues, performances and sensitive portrayal of India-Pakistan relations. It was described by analysts as having themes pertaining to a shared Punjabi culture, secularism and feminism, among others. The film won several awards in major Indian film award ceremonies. It won four awards at the Filmfare Awards, including Best Film and Best Story. At the 6th IIFA Awards, the film won 7 awards, including Best Film, Best Director, Best Actor and Best Supporting Actress. It also won the Best Popular Film Providing Wholesome Entertainment at the National Film Awards.\n", "wiki_page_id": 1223684, "imdb_id": "tt0420332"}