{"text": "\n\nGravity is a 2013 science fiction thriller film directed, co-written, co-edited, and produced by Alfonso Cuarón. It stars Sandra Bullock and George Clooney as American astronauts who are stranded in space after the mid-orbit destruction of their space shuttle, and their subsequent attempt to return to Earth.\nCuarón wrote the screenplay with his son Jonás and attempted to develop the film at Universal Pictures. Later, the distribution rights were acquired by Warner Bros. Pictures. David Heyman, who previously worked with Cuarón on Harry Potter and the Prisoner of Azkaban (2004), produced the film with him. Gravity was produced entirely in the United Kingdom, where British visual effects company Framestore spent more than three years creating most of the film's visual effects, which make up over 80 of its 91 minutes.\nGravity opened the 70th Venice International Film Festival on August 28, 2013 and had its North American premiere three days later at the Telluride Film Festival. Upon its release, Gravity was met with critical acclaim. Particular praise was given to Emmanuel Lubezki's cinematography, Steven Price's musical score, Cuarón's direction, Bullock's performance, Framestore's visual effects, and its use of 3D. Considered one of the best films of 2013, it appeared on numerous critics' year-end lists, and was selected by the American Film Institute in their annual Movies of the Year list. The film became the eighth highest-grossing film of 2013 with a worldwide gross of over $723 million, against a production budget of $100 million.\nThe film earned accolades from numerous critics and guilds. At the 86th Academy Awards, Gravity received ten nominations, including Best Actress for Bullock and Best Picture, and won seven awards, including Best Director, Best Original Score, Best Cinematography and Best Visual Effects. The film was also awarded six BAFTA Awards, including Outstanding British Film and Best Director, the Golden Globe Award for Best Director, seven Critics' Choice Movie Awards, and the 2013 Ray Bradbury Award.\n", "wiki_page_id": 30294906, "imdb_id": "tt1454468"}