{"text": "\n\nCars is a 2006 American computer-animated comedy-adventure film produced by Pixar Animation Studios and released by Walt Disney Pictures. Directed and co-written by John Lasseter, Cars is Pixar's final independently-produced film before its purchase by Disney in May 2006. Set in a world populated entirely by anthropomorphic cars and other vehicles, the film stars the voices of Owen Wilson, Paul Newman (in his final acting role), Bonnie Hunt, Larry the Cable Guy, Tony Shalhoub, Cheech Marin, Michael Wallis, George Carlin, Paul Dooley, Jenifer Lewis, Guido Quaroni, Michael Keaton, Katherine Helmond, John Ratzenberger and Richard Petty. Race car drivers Dale Earnhardt, Jr., Mario Andretti, Michael Schumacher and car enthusiast Jay Leno (as \"Jay Limo\") voice themselves.\nCars premiered on May 26, 2006 at Lowe's Motor Speedway in Concord, North Carolina and was theatrically released worldwide on June 9, 2006 to generally positive reviews from critics. It was nominated for two Academy Awards including Best Animated Feature and won the Golden Globe Award for Best Animated Feature Film. The film was released on DVD on November 7, 2006 and on Blu-ray in 2007. The film was accompanied by the short One Man Band for its theatrical and home media releases. Merchandise based on the film (including scale models of several of the cars) broke records for retail sales of merchandise based on a Disney/Pixar film, bringing an estimated $10 billion for 5 years after the film's release. The film was dedicated to Joe Ranft, the film's co-director and co-writer, who died in a car accident during the film's production.\nA sequel titled Cars 2 was released on June 24, 2011 and a spin-off film titled Planes and produced by Disneytoon Studios was released on August 9, 2013, which was followed by its own sequel, Planes: Fire & Rescue, released on July 18, 2014. A series of short animated films titled Cars Toons debuted in 2008 on Disney Channel and Disney XD. A second sequel, Cars 3, was released on June 16, 2017.", "wiki_page_id": 920613, "imdb_id": "tt1216475"}