{"text": "The Chronicles of Narnia: Prince Caspian is a 2008 American high fantasy film based on Prince Caspian, the second published, fourth chronological novel in C. S. Lewis's epic fantasy series, The Chronicles of Narnia. It is the second in The Chronicles of Narnia film series from Walden Media, following The Chronicles of Narnia: The Lion, the Witch and the Wardrobe (2005).  William Moseley, Anna Popplewell, Skandar Keynes, Georgie Henley, Liam Neeson, and Tilda Swinton reprise their roles from the first film, while new cast includes Ben Barnes, Sergio Castellitto, Peter Dinklage, Eddie Izzard, Warwick Davis, Ken Stott, and Vincent Grass. In the film, the four Pevensie children return to Narnia to aid Prince Caspian in his struggle with the \"secret\" help of Aslan for the throne against his corrupt uncle, King Miraz. The film was released on May 16, 2008 in the United States and on June 26, 2008 in the United Kingdom.\nPrince Caspian, a British-American production, is the last Narnia film to be co-produced by Walt Disney Pictures, as 20th Century Fox became the distributor for the next film The Chronicles of Narnia: The Voyage of the Dawn Treader. Work on the script began before The Lion, the Witch and the Wardrobe was released, so filming could begin before the actors grew too old for their parts. Director Andrew Adamson wanted to make the film more spectacular than the first, and created an action sequence not in the novel. The Narnians were designed to look wilder as they have been hiding from persecution, stressing the darker tone of the sequel. The filmmakers also took a Spanish influence for the antagonistic race of the Telmarines. Filming began in February 2007 in New Zealand, but unlike the previous film, the majority of shooting took place in Central Europe, because of the larger sets available in those countries. To keep costs down, Adamson chose to base post-production in the UK, because of recent tax credits there.\nThe film was a moderate success at the box office, grossing over $141 million in the United States and Canada and $278 million in the rest of the world. It received mostly positive reviews from film critics; however, some took issue with the portrayal of all the heroes having British accents while the villains are Spanish in appearance and inflection. The film became 2008's 10th highest-grossing film worldwide.\n", "wiki_page_id": 1882179, "imdb_id": "tt0499448"}