{"text": "\n\nRocky Balboa is a 2006 American sports drama film written, directed by, and starring Sylvester Stallone. The film, which features Stallone as underdog boxer Rocky Balboa, is the sixth film in the Rocky series that began with the Academy Award-winning Rocky thirty years earlier in 1976. The film portrays an aging Balboa in retirement, a widower living in Philadelphia, and the owner and operator of a local Italian restaurant called \"Adrian's,\" named after his late wife.\nRocky Balboa was produced as the concluding sequel to the original Rocky film. According to Stallone, he was \"negligent\" in the production of Rocky V, leaving him and many of the fans disappointed with the presumed end of the series. Stallone also mentioned that the storyline of Rocky Balboa parallels his own struggles and triumphs in recent times. In addition to Stallone, the film stars Burt Young as Paulie, Rocky's brother-in-law, and real-life boxer Antonio Tarver as Mason \"The Line\" Dixon, the heavyweight division champion in the film. Boxing promoter Lou DiBella plays himself in the movie and acts as Dixon's promoter in the film.  Milo Ventimiglia plays Rocky's son Robert, now an adult. It also features the return of two minor characters from the original movie into larger roles in this film: Marie, the young woman that Rocky attempts to steer away from trouble; and Spider Rico, the first opponent that Rocky is shown fighting in the original film. The film also contains many references to characters and objects from previous installments in the series, especially the first.\nThe film was released on December 20, 2006, 30 years after the release of Rocky (1976), by Metro-Goldwyn-Mayer, Columbia Pictures and Revolution Studios, and exceeded box office expectations with a mainly positive critical reaction. It was released in several formats for its home media release, and DVD sales have exceeded $34 million. It was followed by the 2015 spin-off film Creed.\n", "wiki_page_id": 2887437, "imdb_id": "tt0479143"}