{"text": "Woody Allen is an American film director, writer, actor, and comedian. He contributed to many films as either actor, director, writer or sometimes both. Allen wrote four plays for the stage, and has written sketches for the Broadway revue From A to Z, and the Broadway productions Don't Drink the Water (1966) and Play It Again, Sam (1969).His first film was the 1965 comedy What's New Pussycat?, which featured him as both writer and performer. Allen felt that his New Yorker humor was mismatched with the director Clive Donner's British sensibility, and decided he wished to direct all future films from his material. He was unable to prevent the production of films by other directors from previous stage plays of his to which he had already sold the film rights, notably 1972's successful film Play it Again, Sam from the 1969 play of the same name directed by Herbert Ross.\nHis directorial debut was the 1966 film What's Up, Tiger Lily?, in which a dramatic Japanese spy movie was re-dubbed in English with completely new, comic dialog. He continued to write, direct, and star in comedic slapstick films, such as Bananas (1971) and Sleeper (1973), before he found widespread critical acclaim for his romantic comedies Annie Hall (1977) and Manhattan (1979); he won Academy Awards for Best Director and Best Original Screenplay for the former.\nAllen is influenced by European art cinema and ventured into more dramatic territory, with Interiors (1978) and Another Woman (1988) being prime examples of this transition. Despite this, he continued to direct several comedies.\nIn addition to works of fiction, Allen appeared as himself in many documentaries and other works of non-fiction, including Stanley Kubrick: A Life in Pictures, Wild Man Blues and The Concert for New York City. He has also been the subject of and appeared in three documentaries about himself, including To Woody Allen, From Europe with Love in 1980, Woody Allen: A Life in Film in 2001 and the 2011 PBS American Masters documentary, Woody Allen: a Documentary (directed by Robert B. Weide). He also wrote for and contributed to a number of television series early in his career, including The Tonight Show as guest host.\nAccording to Box Office Mojo, Allen's films have grossed a total of more than $575 million, with an average of $14 million per film (domestic gross figures as a director.) Currently, all of the films he directed for American International Pictures, United Artists and Orion Pictures between 1965 and 1992 are owned by Metro-Goldwyn-Mayer, which acquired all the studios in separate transactions. The films he directed by ABC Pictures are now property of American Broadcasting Company, who in turn licensed their home video rights to MGM.\n", "wiki_page_id": 2461472, "imdb_id": "tt0070707"}