{"text": "\n\nBatman & Robin is a 1997 American superhero film based on the DC Comics characters Batman and Robin. It is the fourth and final installment of Warner Bros.' initial Batman film series. The film was directed by Joel Schumacher and written by Akiva Goldsman. It stars Arnold Schwarzenegger, George Clooney, Chris O'Donnell, Alicia Silverstone, and Uma Thurman. Batman & Robin tells the story of the titular characters as they attempt to prevent Mr. Freeze and Poison Ivy from freezing all mankind to death and repopulating the earth with mutant plants, while at the same time struggling to keep their partnership together. It is also to date the only live-action film appearance of Batgirl, who helps the title characters fight the villains.\nWarner Bros. fast-tracked development for Batman & Robin following the box office success of the previous film, Batman Forever. Schumacher and Goldsman conceived the storyline during pre-production on A Time to Kill, while Val Kilmer decided not to reprise the role over scheduling conflicts with The Saint. Schumacher had a strong interest in casting William Baldwin in Kilmer's place before George Clooney won the role. Principal photography began in September 1996 and finished in January 1997, two weeks ahead of the shooting schedule.\nBatman & Robin premiered in Los Angeles on June 12, 1997, and went into general release on June 20, 1997. While it performed modestly at the box office, making $238.2 million worldwide against a production budget of $125 million, the film was a critical failure and is often considered to be one of the worst films of all time. It is also the lowest grossing live-action Batman movie to date. Due to the film's negative reception, Warner Bros. cancelled a sequel, Batman Unchained, and rebooted the film series with Batman Begins in 2005. One of the songs recorded for the film, \"The End Is the Beginning Is the End\" by The Smashing Pumpkins, won a Grammy Award for Best Hard Rock Performance at the 40th Grammy Awards.\n", "wiki_page_id": 4729, "imdb_id": "tt0118688"}