{"text": "\n\nTropic Thunder is a 2008 action comedy film directed by Ben Stiller. It stars Stiller, Jack Black, Robert Downey Jr., Jay Baruchel and Brandon T. Jackson as a group of prima donna actors who are making a fictional Vietnam War film. When their frustrated director (played by Steve Coogan) drops them in the middle of a jungle, they are forced to rely on their acting skills to survive the real action and danger. The screenplay by Justin Theroux, Stiller, and Etan Cohen was from a story by Stiller and Theroux. The film was produced by Stuart Cornfeld, Stiller and Eric McLeod for Red Hour Productions and DreamWorks Pictures as an international co-production between the United States, Germany and the United Kingdom.\nStiller's idea for the film originated while playing a minor role in Empire of the Sun, and he later enlisted Theroux and Cohen to help complete the script. After the film was green-lit in 2006, filming took place in 2007 on the Hawaiian island of Kaua'i over thirteen weeks and was later deemed the largest film production in the island's history. The film had an extensive marketing promotion, including faux websites for the three main characters and their fictional films, airing a fictional television special, and selling the energy drink advertised in the film, \"Booty Sweat\".\nThe film received generally positive reviews, with critics praising the film's characters, story, faux trailers, and the performances of Stiller, Downey, Black and Tom Cruise, though the depiction of the mentally handicapped and usage of blackface makeup were seen as controversial. The film's soundtrack and score debuted on August 5, 2008, before the film's theatrical release. Paramount Pictures and DreamWorks released the film in the US on August 13, 2008. In its North American opening weekend, the film earned $26 million and retained the number one position for the first three weekends of release. Downey received Academy Award, BAFTA Award, and Screen Actors Guild Award nominations for his performance, with both him and Cruise receiving nominations for a Golden Globe Award for Best Supporting Actor – Motion Picture. The film grossed more than $188 million worldwide before its release on home video on November 18, 2008.\n", "wiki_page_id": 11942501, "imdb_id": "tt0942385"}