{"text": "\n\nSholay ( pronunciation , meaning \"Embers\") is a 1975 Indian action-adventure film in Hindi language, written by Salim-Javed, directed by Ramesh Sippy, and produced by his father G. P. Sippy. The film is about two criminals, Veeru and Jai (played by Dharmendra and Amitabh Bachchan, respectively), hired by a retired police officer (Sanjeev Kumar) to capture the ruthless dacoit Gabbar Singh (Amjad Khan). Hema Malini and Jaya Bhaduri also star, as Veeru and Jai's love interests. Sholay is considered a classic and one of the best Indian films. It was ranked first in the British Film Institute's 2002 poll of \"Top 10 Indian Films\" of all time. In 2005, the judges of the 50th Filmfare Awards named it the Best Film of 50 Years.\nThe film was shot in the rocky terrain of Ramanagara, in the southern state of Karnataka, over a span of two and a half years. After the Central Board of Film Certification mandated the removal of several violent scenes, Sholay was released with a length of 198 minutes. In 1990, the original director's cut of 204 minutes became available on home media. When first released, Sholay received negative critical reviews and a tepid commercial response, but favourable word-of-mouth publicity helped it to become a box office success. It broke records for continuous showings in many theatres across India, and ran for more than five years at Mumbai's Minerva theatre. By some accounts, Sholay was the highest-grossing Indian film of all time, adjusted for inflation.\nThe film is a Dacoit Western, combining the conventions of Indian dacoit films with that of Westerns, and is a defining example of the masala film, which mixes several genres in one work. Scholars have noted several themes in the film, such as glorification of violence, conformation to feudal ethos, debate between social order and mobilised usurpers, homosocial bonding, and the film's role as a national allegory. The combined sales of the original soundtrack, scored by R. D. Burman, and the dialogues (released separately), set new sales records. The film's dialogues and certain characters became extremely popular, contributing to numerous cultural memes and becoming part of India's daily vernacular. In January 2014, Sholay was re-released to theatres in the 3D format.\n\n", "wiki_page_id": 648216, "imdb_id": "tt0073707"}