{"text": "\n\nKabhi Khushi Kabhie Gham... (English: Sometimes there's Happiness, Sometimes there's Sorrow), also known as K3G, is a 2001 Indian family drama film written and directed by Karan Johar and produced by Yash Johar. The film stars Amitabh Bachchan, Jaya Bachchan, Shah Rukh Khan, Kajol, Hrithik Roshan and Kareena Kapoor in leading roles, with Rani Mukerji appearing in an extended special appearance. The music was composed by Jatin Lalit, Sandesh Shandilya and Aadesh Shrivastava, with lyrics penned by Sameer and Anil Pandey. The background score was composed by Babloo Chakravarty. The film tells the story of an Indian family, which faces troubles and misunderstandings over their adopted son's marriage to a girl belonging to a lower socio-economic group than them.\nDevelopment of the film began in 1998, soon after the release of Karan's debut film Kuch Kuch Hota Hai (1998). Principal photography began on 16 October 2000 in Mumbai and continued in London and Egypt. Kabhi Khushi Kabhie Gham... was promoted with the tag-line \"It's All About Loving Your Parents\". Initially scheduled to release during the Diwali festivities of 2001, the film eventually released in India, United Kingdom and North America on 14 December 2001. In 2003, it became the first Indian film to be given a theatrical release in Germany. Upon release, the film met with mixed reviews from film critics and received polarising reactions to Karan Johar's \"larger-than-life\" directorial style, with some seeing it as an \"oddly hollow film\".\nMade on a budget of ₹400 million (US$5.6 million), Kabhi Khushi Kabhie Gham... emerged as a major commercial success, both domestically and internationally, with a lifetime gross of ₹1.35 billion (US$19 million). Outside India, the film was the highest grossing Indian film ever, until its record was broken by Karan's next directorial, Kabhi Alvida Naa Kehna (2006). Kabhi Khushi Kabhie Gham... won several awards at popular award ceremonies the following year, including five Filmfare Awards.\n", "wiki_page_id": 581185, "imdb_id": "tt0248126"}