{"text": "Ran (乱, Japanese for \"chaos\" or \"turmoil\") is a 1985 period tragedy film directed, edited and co-written by Akira Kurosawa. The plot of the film derives from Shakespeare's King Lear and includes segments based on legends of the daimyō Mōri Motonari. The film stars Tatsuya Nakadai as Hidetora Ichimonji, an aging Sengoku-period warlord who decides to abdicate as ruler in favor of his three sons.\nThe film is a Japanese-French venture produced by Herald Ace, Nippon Herald Films and Greenwich Film Productions. The production planning of Ran went through a long period of preparation. Kurosawa conceived the idea of Ran in the mid-1970s, when he read about Motonari, who was famous for having three highly loyal sons. Kurosawa devised a plot in which the sons become antagonists of their father. Although the film became heavily inspired by Shakespeare's play King Lear, Kurosawa began using it only after he had started pre-planning for Ran. Following this pre-planning, Kurosawa filmed Dersu Uzala in 1975 followed by Kagemusha in the early 1980s before securing financial backing to film Ran.\nRan was Kurosawa's second encounter with Shakespeare during his filmmaking career. In 1957, Kurosawa had directed Throne of Blood (蜘蛛巣城, Kumonosu-jō, \"Spider Web Castle\") based on Shakespeare's Macbeth. The film transposes the plot of William Shakespeare's play Macbeth from Medieval Scotland to feudal Japan, with stylistic elements drawn from Noh drama. Throne of Blood tells the story of a warrior, like Macbeth, who assassinates his sovereign at the urging of his ambitious wife. Despite the changes in setting and language, both Ran and Throne of Blood are considered to be among the best film adaptations of King Lear and Macbeth, respectively.\nAs Kurosawa's last epic, Ran has often been cited as amongst his finest achievements. With a budget of $11 million, it was the most expensive Japanese film produced up to that time. Ran was previewed on  May 31, 1985, at the Tokyo International Film Festival before its release on June 1, 1985, in Japan. The film was hailed for its powerful images and use of color—costume designer Emi Wada won an Academy Award for Best Costume Design for her work on Ran. The distinctive Gustav Mahler–inspired film score was composed by Toru Takemitsu.\n", "wiki_page_id": 75984, "imdb_id": "tt0089881"}