{"text": "Coach Carter is a 2005 American biographical sports drama film directed by Thomas Carter. It is based on the true story of Richmond High School basketball coach Ken Carter (portrayed by Samuel L. Jackson), who made headlines in 1999 for suspending his undefeated high school basketball team due to poor academic results. The story was conceived from a screenplay co-written by John Gatins and Mark Schwahn, who created the TV series One Tree Hill. The film also recycles a handful of plot devices from another television series, The White Shadow, which director Carter also co-starred in. The ensemble cast features Rob Brown, Channing Tatum, Debbi Morgan, and musical entertainer Ashanti.\nThe film was a co-production between the motion picture studios of MTV Films and Tollin/Robbins Productions. Theatrically and for the home video rental market, it was commercially distributed by Paramount Pictures. Coach Carter explores professional ethics, academics and athletics. The sports action in the film was coordinated by the production company ReelSports.  On January 11, 2005, the original motion picture soundtrack was released by the Capitol Records music label. The film score was composed and orchestrated by musician Trevor Rabin.\nCoach Carter premiered in theaters nationwide in the United States on January 14, 2005 grossing $67,264,877 in domestic ticket receipts. The film took in an additional $9,404,929 in business through international release for a combined worldwide total of $76,669,806. Preceding its initial screening in cinemas, the film was generally met with positive critical reviews. With its initial foray into the home video marketplace; the widescreen DVD edition of the film featuring deleted scenes, a music video, and special features among other highlights, was released in the United States on June 21, 2005.\nDespite the film being based on real events taking place during the 1999–2000 school year, there are several references that would have been impossible to make in 1999, including a reference to a player possibly going into the NBA straight out of high school being similar to LeBron James, who was a freshman during the 1999–2000 school year.\n", "wiki_page_id": 1377427, "imdb_id": "tt0393162"}