{"text": "\n\nManos: The Hands of Fate (stylized onscreen as \"MANOS\" The Hands of Fate) is a 1966 American independent horror film.  It was written, directed, and produced by Harold P. Warren who also starred in the film.  It is widely recognized as one of the worst films ever made. In 1993, the television comedy series Mystery Science Theater 3000 (MST3K), a show based on the premise of comedically mocking B movies, featured Manos: The Hands of Fate, helping the film develop a cult status.The film's plot revolves primarily around a vacationing family who lose their way on a road trip. After a long drive in the Texas desert, the family finds themselves trapped at a lodge maintained by a polygamous pagan cult, and they attempt to escape as the cult's members decide what to do with them. The film is infamous for its technical deficiencies, especially its significant editing and continuity flaws; its soundtrack and visuals not being synchronized; tedious pacing; abysmal acting; and several scenes that are seemingly inexplicable or disconnected from the overall plot, such as a couple making out in a car or The Master's wives breaking out in catfights.Warren was an insurance and fertilizer salesman from El Paso, Texas, who produced the film as the result of a bet. He also starred in it, alongside El Paso theater actors Tom Neyman and John Reynolds. Manos was an independent production by a crew with little or no background or experience in filmmaking and a very limited budget at its disposal. Upon its theatrical debut, the film was poorly received, playing only at the Capri Theater in El Paso and some drive-ins in West Texas and New Mexico. It remained obscure until its Mystery Science Theater appearance in 1993, which sparked two DVD releases (the original film and the three separate releases of DVDs featuring the MST3K episode of the film). The original 16 mm workprint was discovered in California in 2011, from which a new copy of the film, of vastly superior visual quality, was released on Blu-ray by Synapse Films on October 13, 2015.\n", "wiki_page_id": 246355, "imdb_id": "tt0060666"}