{"text": "\n\nShrek 2 is a 2004 American computer-animated, comedy film directed by Andrew Adamson, Kelly Asbury and Conrad Vernon. It is the sequel to 2001's Shrek and the second installment in the Shrek film franchise. The film stars Mike Myers, Eddie Murphy and Cameron Diaz, who reprise their respective voice roles of Shrek, Donkey, and Fiona. They are joined by new characters voiced by Antonio Banderas, Julie Andrews, John Cleese, Rupert Everett, and Jennifer Saunders. Shrek 2 takes place following the events of the first film, with Shrek and Donkey meeting Fiona's parents as her zealous Fairy Godmother, who wants Fiona to marry her son Prince Charming, plots to destroy Shrek and Fiona's marriage. Shrek and Donkey team up with a swashbuckling cat named Puss in Boots to foil her plans.\nDevelopment began in 2001, and following disagreements with producers, the screenwriters from the first film were replaced with Adamson. The story was inspired by Guess Who's Coming to Dinner (1967), and new animation tools were utilized to improve the visual appearance of each character, particularly Puss in Boots. The lead actors also received a significant bump in salary to $10 million, which at the time was among the highest contracts in their respective careers.\nShrek 2 premiered at the 2004 Cannes Film Festival, where it competed for the Palme d'Or, and it was released in theatres on May 19, 2004. Met with favorable reviews like its predecessor, the film grossed $919.8 million worldwide. It scored the second-largest, three-day opening weekend in US history and the largest opening for an animated film at the time of its release. It went on to become the highest-grossing film of 2004 worldwide. Shrek 2 is also DreamWorks' most successful film to date, and it held the title of being the highest-grossing animated film of all time worldwide until Toy Story 3 surpassed it in 2010. The film received two Academy Award nominations for Best Animated Feature and Best Original Song, and its associated soundtrack reached the Top 10 on the US Billboard 200. A sequel entitled Shrek the Third was released in 2007.\n\n", "wiki_page_id": 525314, "imdb_id": "tt0298148"}