{"text": "\n\nGrindhouse is a 2007 American horror film double feature co-written, produced, and directed by Robert Rodriguez and Quentin Tarantino. The double feature consists of two feature-length segments, Rodriguez's Planet Terror and Tarantino's Death Proof, and is bookended by fictional trailers for upcoming attractions (though two of the trailers, Machete and Hobo with a Shotgun, have since been made into movies), advertisements, and in-theater announcements. The film's title derives from the U.S. film industry term \"grindhouse\", which refers to (now mostly defunct) movie theaters specializing in B movies, often exploitation films, shown in a multiple-feature format. The film stars Rose McGowan, Freddy Rodriguez, Marley Shelton, Michael Biehn, Jeff Fahey, Josh Brolin, Naveen Andrews, Fergie, Bruce Willis, Kurt Russell, Rosario Dawson, Tracie Thoms, Mary Elizabeth Winstead, and stuntwoman Zoë Bell, who plays herself.\nRodriguez's segment, Planet Terror, revolves around an outfit of rebels attempting to survive an onslaught of zombie-like creatures as they feud with a rogue military unit, while Tarantino's segment, Death Proof, focuses on a misogynistic, psychopathic stuntman who targets young women, murdering them with his \"death proof\" stunt car. Each feature is preceded by faux trailers of exploitation films in other genres that were developed by other directors.\nAfter the film was released on April 6, 2007, ticket sales performed significantly below box office analysts' expectations despite mostly positive critic reviews. In much of the rest of the world, each feature was released separately in extended versions. Two soundtracks were also released for the features and include music and audio snippets from the film. The feature later found more success on DVD and Blu-ray. In several interviews, despite the box office failure, the directors have expressed their interest in a possible sequel to the film due to its critical acclaim and successful home media sales. Three spin-off films were later made, based on Grindhouse's fake trailers: Machete, Machete Kills and Hobo with a Shotgun.\n", "wiki_page_id": 2819577, "imdb_id": "tt0462322"}