{"text": "\n\nThe Haunting is a 1963 British horror film directed and produced by Robert Wise and adapted by Nelson Gidding from the 1959 novel The Haunting of Hill House by Shirley Jackson. It stars Julie Harris, Claire Bloom, Richard Johnson, and Russ Tamblyn. The film depicts the experiences of a small group of people invited by a paranormal investigator to investigate a purportedly haunted house.\nScreenwriter Gidding, who had worked with director Wise on the 1958 film I Want to Live!, began a six-month write of the script after reading the book, which Wise had given to him. He perceived the book to be more about mental breakdown than ghosts, and although he was informed after meeting author Shirley Jackson that it was very much a supernatural novel, elements of mental breakdown were introduced into the film. The film was shot at MGM-British Studios in the United Kingdom on a budget of US$1.05 million, with exteriors and the grounds shot at Ettington Park (now the Ettington Park Hotel) in the village of Ettington, Warwickshire. Julie Harris was cast by Wise who found her ideal for the psychologically fragile Eleanor, though during production she suffered from depression and had an uneasy relationship with her co-stars. The interior sets were by Elliot Scott, credited by Wise as instrumental in the making of The Haunting. They were designed to be brightly lit, with no dark corners or recesses, and decorated in a Rococo style; all the rooms had ceilings to create a claustrophobic effect on film. Numerous devices and tricks were used in the filming. Wise used a 30mm anamorphic, wide-angle lens Panavision camera that was not technically ready for use and caused distortions. It was only given to Wise on condition that he sign a memorandum in which he acknowledged that the lens was imperfect. Wise and cinematographer Davis Boulton planned sequences that kept the camera moving, utilizing low-angle takes, and incorporating unusual pans and tracking shots.\nUpon release on 18 September 1963, the film performed moderately at the box office and was well received, although the plot was widely criticized for being incoherent. Today it has achieved cult status and is considered by many to be one of the best horror films in cinematic history, and one of the most unsettling.  In 2010, The Guardian newspaper ranked it as the 13th-best horror film of all time. Director Martin Scorsese has placed The Haunting first on his list of the 11 scariest horror films of all time. The Haunting was released on DVD in its original screen format with commentary in 2003, and was released on Blu-ray on 15 October 2013. The film was remade in 1999 by director Jan de Bont, starring Liam Neeson, Lili Taylor, Catherine Zeta Jones and Owen Wilson, but this version was heavily panned by critics and audiences alike.\n", "wiki_page_id": 950929, "imdb_id": "tt0057129"}