{"text": "\n\nMulholland Drive (stylized as Mulholland Dr.) is a 2001 neo-noir mystery film written and directed by David Lynch and starring Naomi Watts, Laura Harring, Justin Theroux, Ann Miller, and Robert Forster. It tells the story of an aspiring actress named Betty Elms (Watts), newly arrived in Los Angeles, who meets and befriends an amnesiac woman (Harring) recovering from a car accident. The story follows several other vignettes and characters, including a Hollywood film director (Theroux).\nOriginally conceived as a television pilot, a large portion of the film was shot in 1999 with Lynch's plan to keep it open-ended for a potential series. After viewing Lynch's version, however, television executives rejected it. Lynch then provided an ending to the project, making it a feature film. The half-pilot, half-feature result, along with Lynch's characteristic style, has left the general meaning of the film's events open to interpretation. Lynch has declined to offer an explanation of his intentions for the narrative, leaving audiences, critics, and cast members to speculate on what transpires. He gave the film the tagline \"A love story in the city of dreams\".Categorized as a psychological thriller, the film earned Lynch the Prix de la mise en scène (Best Director Award) at the 2001 Cannes Film Festival, as well as an Academy Award nomination for Best Director. Mulholland Drive launched the careers of Watts and Harring and was the last feature film to star veteran Hollywood actress Ann Miller. It is now widely regarded as one of Lynch's finest works, and as one of the greatest films of the 21st century. A. O. Scott of The New York Times writes that while some might consider the plot an \"offense against narrative order ... the film is an intoxicating liberation from sense, with moments of feeling all the more powerful for seeming to emerge from the murky night world of the unconscious\".In the British Film Institute's 2012 Sight & Sound Poll, Mulholland Drive was ranked the 28th greatest film ever made. Having received 40 critics' votes, it is the only film from the 21st century to be included in the list. In 2016, Mulholland Drive was named as the greatest film of the 21st century in a poll conducted by BBC Culture.\n", "wiki_page_id": 20786, "imdb_id": "tt0166924"}