{"text": "\n\nBattlefield Earth (also referred to as Battlefield Earth: A Saga of the Year 3000) is a 2000 American science fiction action film based upon the first half of L. Ron Hubbard's 1982 novel of the same name. Directed by Roger Christian and starring John Travolta, Barry Pepper and Forest Whitaker, the film depicts an Earth that has been under the rule of the alien Psychlos for 1,000 years and tells the story of the rebellion that develops when the Psychlos attempt to use the surviving humans as gold miners.Travolta, a long-time Scientologist, had sought for many years to make a film of the novel by Hubbard, the founder of Scientology. He was unable to obtain funding from any major studio due to concerns about the film's script, prospects and connections with Scientology. The project was eventually taken on in 1998 by an independent production company, Franchise Pictures, which specialized in rescuing stars' stalled pet projects. Travolta signed on as a co-producer and contributed millions of dollars of his own money to the production, which commenced in 1999 and was largely funded by German film distribution company Intertainment AG. Franchise was later sued by its investors and was bankrupted in 2004 after it emerged that it had fraudulently overstated the film's budget by $31 million.Battlefield Earth was released on May 12, 2000, and was an immediate critical and commercial failure, frequently described as one of the worst films of all time. Reviewers criticized virtually every aspect of the production including Travolta's acting, overuse of angled shots and slow-motion, poor script, mediocre special effects, several plot holes and narrative inconsistencies, art direction and dialogue. Audiences were reported to have ridiculed early screenings and stayed away from the film after its opening weekend, which led to Battlefield Earth failing to recoup its costs. The film went on to receive a total of eight Golden Raspberry Awards, which until 2012 was the most Razzie Awards given to a single film, additionally winning Worst Picture of the Decade in 2010. It has since become a cult film in the \"so bad, it's good\" vein.\nTravolta originally envisioned Battlefield Earth as the first of two films to be adapted from the book, as the screenplay only covered the first half of the novel. However, the film's poor box office performance, as well as the collapse of Franchise Pictures, ended plans for a potential sequel.\n", "wiki_page_id": 6976850, "imdb_id": "tt0185183"}