{"text": "\n\nA Nightmare on Elm Street is a 2010 American slasher film directed by Samuel Bayer, and written by Wesley Strick and Eric Heisserer. The film stars Jackie Earle Haley, Kyle Gallner, Rooney Mara, Katie Cassidy, Thomas Dekker, and Kellan Lutz. It is a remake of Wes Craven's 1984 film of the same name; produced by Michael Bay and Platinum Dunes, it is designed to reboot the Nightmare on Elm Street franchise. The film centers around a group of teenagers being stalked and murdered in their dreams by a man named Freddy Krueger, ultimately discovering they all share a common link from their childhood that is making them targets for Freddy.\nA Nightmare on Elm Street was originally going to follow the same design as Platinum Dunes' other remake, Friday the 13th, with the writers taking the best elements from each of the films in the original series and creating a single storyline with them. Eventually, they decided to use Craven's original storyline, and try to create a scarier film. That being, they decided to remove the one-line quipping Freddy, who had become less scary and more comical over the years, and bring him back to a darker nature; this included developing the character as a true child molester, something that Craven wanted to do originally in 1984 but changed to a simple child killer. The decision was also made to bring Freddy's physical appearance closer to that of an actual burn victim, and the use of computer-generated imagery was used in certain sections of Haley's face to further assist in that vision. A Nightmare on Elm Street was primarily filmed in Illinois because of the positive experience the producers of Platinum Dunes had when filming other films in the same area.\nCraven has expressed his displeasure with the remaking of his film, primarily because he was not consulted on the project as has been done on previous films of his that have been remade. Robert Englund, who portrayed Freddy in the previous eight films, voiced his support of the remake and the casting of Haley in the role of Freddy. A Nightmare on Elm Street was officially released in North America on April 30, 2010, and later released in foreign markets on May 8, 2010. The film was met with primarily negative reviews from film critics, as well as audience members who scored the film a \"C+\" according to CinemaScore polls. Regardless, A Nightmare on Elm Street broke the record for midnight openings for a horror film, and was able to gross more in its opening weekend than the entire theatrical gross for four other Nightmare on Elm Street films. The film has brought in over $63 million at the domestic box office, and over $115 million worldwide.\n", "wiki_page_id": 23286957, "imdb_id": "tt1179056"}