{"text": "\n\nStar Trek: Insurrection is a 1998 American science fiction film directed by Jonathan Frakes and based on the franchise of the same name created by Gene Roddenberry. It is the ninth film in the Star Trek film series, as well as the third to star the cast of Star Trek: The Next Generation, with F. Murray Abraham, Donna Murphy and Anthony Zerbe appearing in main roles. In the film, the crew of the USS Enterprise-E rebels against Starfleet, after they discover a conspiracy with a species known as the Son'a to steal the peaceful Ba'ku's planet for its rejuvenating properties.\nParamount Pictures sought a change in pace after the previous film in the series, Star Trek: First Contact (1996). Michael Piller was asked to write its script, which was created from story ideas by Piller and producer Rick Berman. The story's first drafts featured the Romulans, and the Son'a and Ba'ku were introduced in its third draft. After Ira Steven Behr reviewed the script, Piller revised it and added a subplot involving a romantic interest for Jean-Luc Picard. The film's ending was further revised after test screenings. The special effects depicting outer space were completely computer generated, a first for a Star Trek film. The Ba'ku village was fully built on location at Lake Sherwood, California, but suffered weather damage. Sets from the television series Star Trek: Voyager and Star Trek: Deep Space Nine were reused and redressed. Michael Westmore created the make-up for the new alien races, and Robert Blackman revised the Starfleet dress uniform designs. Sanja Milkovic Hayes created costumes for the Ba'ku from cellulose fibers, which were baked and glued together. Jerry Goldsmith produced the film's score; his fourth for the franchise.\nInsurrection was the highest-grossing film on its opening weekend, making $70.1 million in the United States and Canada and an additional $42.4 million in other territories, for a theatrical run of about $117.8 million worldwide. Critical responses to the film were mixed; the performance of Patrick Stewart and the directing of Jonathan Frakes were praised, while other critics compared it to an extended episode of the television series. Insurrection was nominated for both a Saturn Award and a Hugo Award, but the only award it received was a Youth in Film Award for Michael Welch.\n", "wiki_page_id": 157239, "imdb_id": "tt0120844"}