{"text": "Sunrise: A Song of Two Humans (also known as Sunrise) is a 1927 American silent romantic drama film directed by German director F. W. Murnau and starring George O'Brien, Janet Gaynor, and Margaret Livingston. The story was adapted by Carl Mayer from the short story \"The Excursion to Tilsit\", from the collection with the same title by Hermann Sudermann.Murnau chose to use the then new Fox Movietone sound-on-film system, making Sunrise one of the first feature films with a synchronized musical score and sound effects soundtrack. The film incorporated Charles Gounod's 1872 composition Funeral March of a Marionette, which was later used as the theme for the television series Alfred Hitchcock Presents (1955–65). Frédéric Chopin's A minor prelude also features prominently in orchestral arrangement.\nSunrise won the Academy Award for Unique and Artistic Picture at the 1st Academy Awards in 1929. Janet Gaynor won the first Academy Award for Best Actress in a Leading Role for her performance in the film (she also won for her performances in 1927's 7th Heaven and 1928's Street Angel). The film's legacy has endured, and it is now widely considered a masterpiece and one of the greatest films ever made. Many have called it the greatest film of the silent era. In 1989, Sunrise was selected for preservation in the National Film Registry of the United States Library of Congress for films that are \"culturally, historically, or aesthetically significant\". The Academy Film Archive preserved Sunrise in 2004.\nThe 2007 update of the American Film Institute's list of the 100 greatest American films ranked it number 82, and the British Film Institute's 2012 Sight & Sound critics' poll named it the fifth-best film in the history of motion pictures, while directors named it 22nd.Although the original 35mm negative of the original American version of Sunrise was destroyed in the 1937 Fox vault fire, a new negative was created from a surviving print.", "wiki_page_id": 61904, "imdb_id": "tt0018455"}