{"text": "\n\nHalloween is a 1978 American slasher film directed and scored by John Carpenter, co-written with producer Debra Hill, and starring Donald Pleasence and Jamie Lee Curtis in her film debut. The film tells the story of Michael Myers, who was committed to a sanitarium as a child for the murder of his older sister Judith Myers. Fifteen years later, he escapes to stalk and kill the people of the fictional town of Haddonfield, Illinois while being chased by his former psychiatrist, Samuel Loomis.\nFilmed in the spring of 1978 in Southern California, Halloween was produced on a budget of $300,000. Released on October 25, 1978, it grossed $47 million at the box office in the United States and $23 million internationally for a total of $70 million worldwide, selling almost 30 million tickets in 1978 and becoming one of the most profitable independent films. Primarily praised for its direction and musical score, many credit the film as the first in a long line of slasher films inspired by Alfred Hitchcock's Psycho (1960). Some critics have suggested that Halloween may encourage sadism and misogyny by audiences identifying with its villain. Others have suggested the film is a social critique of the immorality of youth and teenagers in 1970s America, with many of Myers' victims being sexually promiscuous substance abusers, while the lone heroine is depicted as innocent and pure, hence her survival. Carpenter dismisses such analyses.\nHalloween spawned a film franchise, including seven successive sequels which helped construct an extensive backstory for the film's antagonist, Michael Myers, sometimes narratively diverging entirely from previous installments. In 2007, a remake was released, which itself was followed by a sequel in 2009. An eleventh installment, a direct sequel to the 1978 film that ignores the previous entries, will be released in October 2018, with Curtis reprising her role for the fourth time in the series. Additionally, a novelization, video game, and comic book series have been based on the film. In 2006, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant.\"\n", "wiki_page_id": 20179415, "imdb_id": "tt0077651"}