{"text": "\n\nWALL-E (stylized with an interpunct as WALL·E) is a 2008 American computer-animated science fiction film produced by Pixar Animation Studios for Walt Disney Pictures. It was directed and co-written by Andrew Stanton, produced by Jim Morris, and co-written by Jim Reardon. It stars the voices of Ben Burtt, Elissa Knight, Jeff Garlin, Fred Willard, John Ratzenberger, Kathy Najimy, Sigourney Weaver, and the MacInTalk system, and was the overall ninth feature film produced by the company. It follows a trash compactor robot in a deserted world, left to clean a largely abandoned city. However, he is visited by a probe sent by the Axiom ship, whom he falls in love with and pursues across the galaxy.\nAfter directing Finding Nemo, Stanton felt Pixar had created believable simulations of underwater physics and was willing to direct a film set largely in space. WALL-E has minimal dialogue in its early sequences; many of the characters do not have voices, but instead communicate with body language and robotic sounds designed by Burtt. The film criticizes consumerism, corporatism, nostalgia, waste management, human environmental impact and concerns, obesity, and global catastrophic risk. It is also Pixar's first animated film with segments featuring live-action characters. Following Pixar tradition, WALL-E was paired with a short film titled Presto for its theatrical release.\nWALL-E was released in the United States on June 27, 2008. The film was an instant blockbuster, grossing $533.3 million worldwide over a $180 million budget, and winning the 2008 Golden Globe Award for Best Animated Feature Film, the 2009 Hugo Award for Best Long Form Dramatic Presentation, the final Nebula Award for Best Script, the Saturn Award for Best Animated Film and the Academy Award for Best Animated Feature with five nominations. The film also topped Time's list of the \"Best Movies of the Decade\", and in 2016 was voted 29th among 100 films considered the best of the 21st century by 117 film critics from around the world.", "wiki_page_id": 8980330, "imdb_id": "tt0910970"}