{"text": "\n\nCinderella is a 2015 romantic fantasy film directed by Kenneth Branagh, with a screenplay written by Chris Weitz, and co-produced by Walt Disney Pictures, Kinberg Genre, Allison Shearmur Productions and Beagle Pug Films. The film is based on the eponymous folk tale and inspired in part by Walt Disney's 1950 animated film of the same name. The film features an ensemble cast including Lily James as the eponymous character and Cate Blanchett as the stepmother, with Richard Madden, Stellan Skarsgård, Holliday Grainger, Sophie McShera, Nonso Anozie, Derek Jacobi, and Helena Bonham Carter.\nDevelopment for a live-action reimagining of the original animated film began in May 2010, with producer Simon Kinberg attached to the project. In late January 2013, Branagh signed on to direct, with Weltz hired to revise a script from Aline Brosh McKenna. In November 2012, casting began with Blanchett being the first to sign on; James was eventually cast in the titular role in April 2013. Principal photography began at Pinewood Studios in Buckinghamshire, England on September 23, 2013 and ended on December 14.\nCinderella had its world premiere on February 13, 2015, at the 65th Berlin International Film Festival and was released theatrically in the United States on March 13, 2015 and in the United Kingdom on March 27 in standard and IMAX formats by Walt Disney Studios Motion Pictures. The film grossed over $543 million worldwide, becoming Branagh's highest-grossing film to date as a director. The film received mostly positive reviews from critics, with many praising James' and Blanchett's performances as well as the ensemble cast, production values, musical score, direction, costume design, and faithfulness to the original animated film. The film received a nomination at the 21st Critics' Choice Awards and the 69th British Academy Film Awards, both for costume design. The film also received an Academy Award nomination for Best Costume Design at the 88th Academy Awards.\n", "wiki_page_id": 40038204, "imdb_id": "tt1661199"}