{"text": "\n\nBajirao Mastani is a 2015 Indian epic historical romance film directed by Sanjay Leela Bhansali, who also composed its soundtrack. The film was jointly produced by Bhansali and Eros International's Kishore Lulla; it stars Ranveer Singh, Deepika Padukone and Priyanka Chopra. The supporting cast includes Tanvi Azmi, Vaibhav Tatwawaadi and Milind Soman. Based on the Marathi novel Raau by Nagnath S. Inamdar, Bajirao Mastani narrates the story of the Maratha Peshwa Bajirao I (1700–1740 AD) and his second wife Mastani.\nConceived as early as the 1990s, Bhansali announced the film in 2003 but production was delayed several times due to its changing cast. Bajirao Mastani, a passion project for Bhansali, spent the next eleven years in development hell before being revived in 2014. Extensive research was done before moving into pre-production, which required the creation of twenty-two highly detailed sets, and numerous costumes and props to strengthen its opulence and high production value. Principal photography took place on sets constructed in Film City, with some portions being filmed on location. Visual effects and CGI were used in post-production to enhance a number of scenes.\nThe film was released on 18 December 2015 to positive reviews, with praise directed towards Bhansali's direction, various technical achievements and the performances of the cast. Bajirao Mastani has also been noted for its scale, grandeur and attention to detail. With a budget of ₹145 crores, including marketing and advertisements, it is one of the most expensive Hindi films. It has grossed over ₹356 crores at the box office, becoming a major commercial success and one of the highest-grossing Indian films of all time.\nRecipient of several accolades, Bajirao Mastani won seven National Film Awards, including Best Direction and Best Supporting Actress for Azmi. The film received a leading fourteen nominations at the 61st Filmfare Awards and won nine awards, including Best Film, Best Director for Bhansali, Best Actor for Singh, and Best Supporting Actress for Chopra.\n", "wiki_page_id": 42367337, "imdb_id": "tt3735246"}