{"text": "\n\nAtlantis: The Lost Empire is a 2001 American animated science fantasy action adventure film created by Walt Disney Feature Animation—the first science fiction film in Disney's animated features canon and the 41st overall. Written by Tab Murphy, directed by Gary Trousdale and Kirk Wise, and produced by Don Hahn, the film features an ensemble cast with the voices of Michael J. Fox, Cree Summer, James Garner, Leonard Nimoy, Don Novello, Phil Morris, Claudia Christian, Jacqueline Obradors, and Jim Varney in his final role before his death. Set in 1914, the film tells the story of a young man who gains possession of a sacred book, which he believes will guide him and a crew of mercenaries to the lost city of Atlantis.\nDevelopment of the film began after production had finished on The Hunchback of Notre Dame (1996). Instead of another musical, the production team decided to do an action-adventure film inspired by the works of Jules Verne. Atlantis was notable for adopting the distinctive visual style of comic book creator Mike Mignola. At the time of its release, the film had made greater use of computer-generated imagery (CGI) than any of Disney's previous traditionally animated features; it remains one of the few to have been shot in anamorphic format. Linguist Marc Okrand created a language specifically for use in Atlantis, with James Newton Howard providing the film's score. The film was released at a time when audience interest in animated films was shifting away from hand-drawn animation toward films with full CGI.\nAtlantis: The Lost Empire premiered at the El Capitan Theatre in Hollywood, California on June 3, 2001, and went into general release on June 15. Released by Walt Disney Pictures, Atlantis performed modestly at the box office. Budgeted at around $90-120 million, the film grossed over $186 million worldwide, $84 million of which was earned in North America. Due to the film's lackluster box office performance, Disney quietly canceled both a spin-off television series and an underwater attraction at its Disneyland theme park. Some critics praised it as a unique departure from typical Disney animated features, while others disliked it due to the unclear target audience and absence of songs. Atlantis was nominated for a number of awards, including seven Annie Awards, and won Best Sound Editing at the 2002 Golden Reel Awards. The film was released on VHS and DVD on January 29, 2002; the Blu-ray released on June 11, 2013. Atlantis is considered to be a cult favorite, due in part to Mignola's unique artistic influence. A direct-to-video sequel, Atlantis: Milo's Return, was released in 2003.\n", "wiki_page_id": 367085, "imdb_id": "tt0230011"}